[
    {
        "code": "ias",
        "color": "#5da733",
        "name_en": "Institute of Applied Sciences",
        "desc_en": "Applied Science relates to the application of scientific knowledge to practical challenges and jobs. At the Institute of Applied Sciences, learners are prepared for technological careers within the health, pharmaceutical, environmental, food and beverage, or general engineering sectors. Students learn to appreciate how the fundamental principles of science relate to the technological operations of the workplace, while developing the skills to work in laboratories, hospitals, farms, and with environmental technologies and methodologies, as well as to apply basic scientific principles in industrial settings. The Institute building at the Main Campus includes eleven fully-equipped laboratories for training and research in several scientific and technological fields. At the Centre for Agriculture, Aquatics and Animal Sciences at the Qormi Campus, learners make use of facilities required for studies in a more practical and hands-on approach.",
        "name_mt": "",
        "desc_mt": "Ix-Xjenza Applikata tirrigwarda l-applikazzjoni ta’ għarfien xjentifiku għal sfidi u impjiegi prattiċi. Fl-Istitut tax-Xjenzi Applikati, l-istudenti jitħejjew għal karrieri teknoloġiċi fis-setturi tas-saħħa, tal-farmaċewtika, ambjentali, tal-ikel u x-xorb, jew setturi ġenerali tal-inġinerija. L-istudenti jitgħallmu japprezzaw kif il-prinċipji fundamentali tax-xjenza jirrelataw mal-operazzjonijiet teknoloġiċi tal-post tax-xogħol, filwaqt li jiżviluppaw il-ħiliet biex jaħdmu f’laboratorji, sptarijiet, azjendi agrikoli, u b’teknoloġiji u metodoloġiji ambjentali, kif ukoll kif japplikaw prinċipji xjentifiċi bażiċi f’ambjenti industrijali. Il-bini tal-Istitut fil-kampus ewlieni jinkludi ħdax-il laboratorju mgħammar b’mod sħiħ għat-taħriġ u r-riċerka f’diversi oqsma xjentifiċi u teknoloġiċi. Fiċ-Ċentru tal-Agrikultura, Akkwatika u x-Xjenza tal-Annimali fil-kampus ta’ Ħal Qormi, l-istudenti jkunu qed jagħmlu użu minn faċilitajiet li huma meħtieġa sabiex jagħmlu l-istudji tagħhom f’ambjent aktar prattiku.",
        "courses": [
            {
                "index": "01-01",
                "institute": "ias",
                "code": "AS1-01-19",
                "title": "Introductory Certificate in Applied Science",
                "desc_en": [
                    "This programme of studies aims to provide the learner with the basic knowledge of science and technology and how these apply to everyday life. The study-units deal with the different disciplines of science, hence giving the learner an overview of all the main scientific concepts necessary as a basis for further vocational studies within the science sector."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji għandu l-għan li jipprovdi lill-istudent l-għarfien bażiku tax-xjenza u t-teknoloġija u kif dawn japplikaw għall-ħajja ta’ kuljum. L-unitajiet ta’ studju jindirizzaw id-dixxiplini differenti tax-xjenza u għaldaqstant jagħtu lill-istudent ħarsa ġenerali lejn il-kunċetti xjentifiċi ewlenin kollha meħtieġa bħala bażi għal studji vokazzjonali ulterjuri fis-settur tax-xjenza."
                ],
                "mqf": 1,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assessment Tests (as may be applicable)",
                "careers": []
            },
            {
                "index": "01-02",
                "institute": "ias",
                "code": "AS2-01-19",
                "title": "Foundation Certificate in Applied Science",
                "desc_en": [
                    "This programme of studies is aimed at giving learners the opportunity to further their studies in several diverse science-related areas including environmental, health and industrial sciences. Learners will cover various topics such as Chemistry, Physics, Biology, English, Maltese, Mathematics and IT which will be taught in an applied manner that is relevant to the various science sectors in which employment may be sought with a higher qualification. This programme is particularly suitable for learners who have a scientific or technical aptitude, even if they have not decided fully on their ultimate career choice."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji għandu l-għan li jagħti lill-istudenti l-opportunità biex ikomplu l-istudji tagħhom f’diversi oqsma differenti relatati max-xjenza inklużi x-xjenzi ambjentali, tas-saħħa u industrijali. L-istudenti jkopru diversi suġġetti bħall-Kimika, il-Fiżika, il-Bijoloġija, l-Ingliż, il-Malti, il-Matematika u l-IT li se jiġu mgħallma b’mod applikat li jkun rilevanti għad-diversi setturi tax-xjenza li fihom jistgħu jsibu impjieg bi kwalifika ogħla. Dan il-programm huwa partikolarment xieraq għall-istudenti li għandhom xeħta għal suġġetti xjentifiċi jew tekniċi, anke jekk ma jkunux għadhom iddeċidew liema karriera se jidħlu għaliha."
                ],
                "mqf": 2,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education",
                    "MCAST Introductory Certificate"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assessment Tests (as may be applicable)",
                "careers": []
            },
            {
                "index": "01-03",
                "institute": "ias",
                "code": "AS3-01-19",
                "title": "Diploma in Applied Science",
                "desc_en": [
                    "This programme of studies provides a strong grounding in fundamental science and technology principles, as well as an initial exposure to vocational science subjects related to health, environment, food and engineering industries. The learner will be able to understand the fundamental principles and laws of science, and how these are applied within the industrial sector.",
                    "The learner will also be able to understand the science of different materials, and gain an awareness of the principles behind certain technologies."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji jipprovdi bażi b’saħħitha għall-prinċipji fundamentali tax-xjenza u t-teknoloġija, kif ukoll introduzzjoni għal suġġetti tax-xjenza vokazzjonali relatati mal-industriji tas-saħħa, l-ambjent, l-ikel u l-inġinerija. L-istudent ikun jista’ jifhem il-prinċipji fundamentali u l-liġijiet tax-xjenza, u kif dawn huma applikati fis-settur industrijali. L-istudent ikun jista’ jifhem ukoll ix-xjenza ta’ materjali differenti, u jikseb għarfien dwar il-prinċipji wara ċerti teknoloġiji."
                ],
                "mqf": 3,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "MCAST Foundation Certificate",
                    "2 SEC\/O-Level\/SSC&P (Level 3) passes from English Language, Mathematics, Physics, Chemistry, Biology, Design and Technology, Health and Social Care"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": []
            },
            {
                "index": "01-04",
                "institute": "ias",
                "code": "AS4-01-19",
                "title": "Advanced Diploma for Pharmacy Technicians",
                "desc_en": [
                    "This programme of studies is designed to provide learners with the skills, knowledge and competences necessary for a career as a pharmacy technician. Learners will be exposed to scientific and pharmaceutical principles and will be given a sound knowledge of health-related material, resulting in a holistic approach to effectively and competently embark on a career as a pharmacy technician.",
                    "This programme of studies is designed to provide learners with all the technical skills, knowledge of procedures, legislation and responsibilities required for such a career and includes work-related training and practice."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji huwa mfassal biex jipprovdi lill-istudenti l-ħiliet, l-għarfien u l-kompetenzi meħtieġa għal karriera bħala tekniku farmaċewtiku. L-istudenti se jiltaqgħu mal-prinċipji xjentifiċi u farmaċewtiċi u jingħataw għarfien sod ta’ materjal relatat mas-saħħa, li jirriżulta f’approċċ ħolistiku biex wieħed jibda karriera b’mod effettiv u kompetenti bħala tekniku farmaċewtiku.",
                    "Dan il-programm ta’ studji huwa mfassal biex jipprovdi lill-istudenti l-ħiliet tekniċi, l-għarfien tal-proċeduri, il-leġiżlazzjoni u r-responsabbiltajiet kollha meħtieġa għal karriera bħal din u jinkludi taħriġ u prattika relatati max-xogħol."
                ],
                "mqf": 4,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "MCAST Diploma in Applied Science",
                    "MCAST Diploma in Health and Social Care (with additional module in Chemistry)",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "English Language, Mathematics, Chemistry",
                "req_preferred": "Biology, Health and Social Care",
                "req_other": "",
                "careers": [
                    "Pharmacy technician"
                ]
            },
            {
                "index": "01-05",
                "institute": "ias",
                "code": "AS4-A2-19",
                "title": "Advanced Diploma in Applied Science",
                "desc_en": [
                    "This programme of studies is aimed at learners who wish to embark on a scientific career in a range of industries such as petrochemical, life sciences, health, pharmaceutics, and environment. The programme of studies contains a wide range of science and technology study-units that reflect aspects of employment within relevant industries.",
                    "The learners will appreciate how the fundamental principles of science relate to the technological operations of the workplace. They will develop the necessary skills to work in a laboratory environment within the manufacturing industry, and to apply basic principles within the workplace."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji huwa mmirat lejn studenti li jixtiequ jibdew karriera xjentifika f’firxa ta’ industriji bħal dawk relatati mal-petrokimika, ix-xjenzi tal-ħajja, is-saħħa, il-farmaċewtika u l-ambjent. Il-programm ta’ studji jinkludi firxa wiesgħa ta’ unitajiet ta’ studju fix-xjenza u t-teknoloġija li jirriflettu aspetti tal-impjiegi f’industriji rilevanti.",
                    "L-istudenti jirrikonoxxu kif il-prinċipji fundamentali tax-xjenza jirrelataw mal-operazzjonijiet tekniċi tal-post tax-xogħol. Huma jiżviluppaw il-ħiliet neċessarji biex jaħdmu f’ambjent ta’ laboratorju fl-industrija tal-manifattura, u biex japplikaw il-prinċipji bażiċi fuq il-post tax-xogħol."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Apprenticeship",
                "req_entry": [
                    "MCAST Diploma in Applied Science",
                    "4 SEC\/O-Level\/SSC&P (Level 3) from English Language, Mathematics, Physics, Chemistry, Biology, Design and Technology, Health and Social Care"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Laboratory analyst",
                    "Laboratory technologist",
                    "Scientific officer"
                ]
            },
            {
                "index": "01-06",
                "institute": "ias",
                "code": "AS4-03-20",
                "title": "Advanced Diploma in Environmental Sustainability",
                "desc_en": [
                    "Awareness of environmental sustainability and related environmentally-based sectors are growing rapidly in Europe, with the Maltese government recently introducing various laws and standards on reducing global warming, climate change, low carbon emissions and the need for conservation in general. This programme of studies includes topics related to environmental monitoring, even within manufacturing industries, that are fundamental to the development of environmental awareness, and provides the necessary practical skills and techniques. Employment is typically within environmental sustainability sector-based organisations, as well as within medium to large organisations that face many environmental challenges, such as waste management, alternative energy sources, traffic management and pollution, on a daily basis."
                ],
                "desc_mt": [
                    "Il-kuxjenza dwar is-sostenibbiltà ambjentali u s-setturi relatati li huma bbażati fuq l-ambjent qed tikber b’mod rapidu fl-Ewropa, u dan l-aħħar il-gvern Malti introduċa diversi liġijiet u standards dwar it-tnaqqis tat-tisħin globali, it-tibdil fil-klima, il-livell baxx ta’ emissjonijiet tal-karbonju u l-ħtieġa għall-konservazzjoni b’mod ġenerali. Dan il-programm ta’ studji jinkludi suġġetti relatati mal-monitoraġġ ambjentali, anke fi ħdan industriji tal-manifattura, li huma fundamentali għall-iżvilupp ta’ kuxjenza ambjentali, u jipprovdi l-ħiliet u t-teknika prattika neċessarji. L-impjieg huwa tipikament f’organizzazzjonijiet ibbażati fuq is-settur tas-sostenibbiltà ambjentali, kif ukoll fi ħdan organizzazzjonijiet medji sa kbar li jiffaċċjaw ħafna sfidi ambjentali fuq bażi ta’ kuljum, bħall-immaniġġjar tal-iskart, is-sorsi alternattivi\tta’ enerġija, il-ġestjoni tat-traffiku u t-tniġġis."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "MCAST Diploma in Applied Science",
                    "MCAST Diploma in Mechanical Engineering",
                    "MCAST Diploma in Engineering (Electronics)",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "At least three (3) from English Language, Mathematics, Physics, Chemistry, Biology, Design and Technology, Computer Studies, Environmental Studies",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Technical project manager",
                    "Environmental technologist",
                    "Environmental analyst"
                ]
            },
            {
                "index": "01-07",
                "institute": "ias",
                "code": "AS4-04-19",
                "title": "Advanced Diploma in Health Sciences",
                "desc_en": [
                    "This programme of studies has been developed to prepare individuals for health-related careers. The study-units deal with the anatomy and physiology of the human body, the physical and psychological changes due to aging, and will help learners to build competences that will help when dealing with people with health issues and challenging behaviour.",
                    "Through work placements, learners will get the opportunity to develop the skills and competences required to work within the health sector."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji ġie żviluppat biex iħejji lill-istudenti għal karrieri relatati mas-saħħa. L-unitajiet ta’ studju jindirizzaw l-anatomija u l-fiżjoloġija tal-ġisem tal-bniedem, it-tibdil fiżiku u psikoloġiku minħabba x-xjuħija, u jgħin lill-istudenti jiżviluppaw kompetenzi li jgħinuhom jitgħallmu kif iġibu ruħhom ma’ persuni bi problemi ta’ saħħa u ta’ mġiba diffiċli.",
                    "Permezz ta’ taħriġ fuq il-post tax-xogħol, l-istudenti jkollhom l-opportunità li jiżviluppaw il-ħiliet u l-kompetenzi meħtieġa biex jaħdmu fis-settur tas-saħħa."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "MCAST Diploma in Applied Science",
                    "MCAST Diploma in Health and Social Care",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "English Language, Mathematics, Biology",
                "req_preferred": "Maltese, Chemistry, Health and Social Care",
                "req_other": "",
                "careers": [
                    "Allied health assistant",
                    "Paramedic aide",
                    "Health administrator"
                ]
            },
            {
                "index": "01-08",
                "institute": "ias",
                "code": "TC4-A1-18",
                "title": "Advanced Diploma in Food Technology",
                "desc_en": [
                    "The food and beverage industry is a dynamic sector which requires a number of highly skilled technical people to cope with constantly changing customers’ demands and new innovative production technologies. Food technologists monitor day-to-day manufacturing activities; ensure that safety and quality standards are met; improve existing products and design innovative foods and drinks. This is a multidisciplinary programme offered across four Institutes and includes topics on food analysis, product manufacturing, food safety, cost accounting and product design. The programme provides learners with the opportunity to gain knowledge of the industry and insights into the relevant tools and skills through work-based elements. This programme prepares learners for employment within SMEs as well as medium to large organizations which produce a range of food and drink products."
                ],
                "desc_mt": [
                    "L-industrija tal-ikel u x-xorb hija settur dinamiku li jirrikjedi għadd ta’ persuni tekniċi bi kwalifiki għoljin biex ilaħħqu mad-domandi tal-konsumaturi li dejjem jinbidlu u mat-teknoloġiji tal-produzzjoni ġodda u innovattivi. It-teknoloġisti tal-ikel jissorveljaw attivitajiet ta’ manifattura minn jum għall-ieħor; jiżguraw li jiġu sodisfatti l-istandards ta’ sikurezza u ta’ kwalità; itejbu prodotti eżistenti u jiddisinjaw ikel u xarbiet ġodda u innovattivi.",
                    "Dan huwa programm multidixxiplinari offrut f’erba’ Istituti u jinkludi suġġetti dwar l-analiżi tal-ikel, il-manifattura tal-prodott, is-sikurezza tal-ikel, il-kontabilità tal-ispejjeż u d-disinn tal-prodott. Il-programm jipprovdi lill-istudenti l-opportunità li jiksbu għarfien dwar l-industrija u l-għodod u l-ħiliet rilevanti permezz ta’ elementi bbażati fuq ix-xogħol. Dan il-programm iħejji lill-istudenti għal impjieg fl-SMEs, kif ukoll f’organizzazzjonijiet medji u kbar li jipproduċu firxa ta’ prodotti ta’ ikel u xorb."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Apprenticeship",
                "req_entry": [
                    "MCAST Diploma in Applied Science",
                    "MCAST Diploma in Mechanical Engineering",
                    "MCAST Diploma in Engineering (Electronics) 4",
                    "SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "English Language, Mathematics, Home Economics, Physics, Chemistry, Biology, Design and Technology, Hospitality",
                "req_other": "",
                "careers": [
                    "Food analyst",
                    "Assistant food technologist",
                    "Food product development technologist",
                    "Food production supervisor",
                    "Food quality assurance technician"
                ]
            },
            {
                "index": "01-09",
                "institute": "ias",
                "code": "AS6-01-19",
                "title": "Bachelor of Science (Honours) in Chemical Technology",
                "desc_en": [
                    "This undergraduate course offers an opportunity to learners to gain a foundation in the core chemistry concepts and the manufacture of chemical products, such as pharmaceuticals, polymers, foods, beverages and petrochemicals. The knowledge, skills and competences attained give individuals an opportunity to succeed in employment in a wide range of manufacturing and processing industries, consulting firms, government, research and educational institutions. The course exposes learners to the development and design of chemical processes at different scales and creates a bridge between science and manufacturing, by applying the principles of chemistry and engineering to solve problems involving the production or use of chemicals. The programme also provides opportunities for learners to focus on the development of higher level skills in a scientific and technological context."
                ],
                "desc_mt": [
                    "Dan il-kors li jwassal għal baċellerat joffri opportunità lill-istudenti biex jiksbu bażi soda fil-kunċetti ewlenin tal-kimika u l-manifattura ta’ prodotti kimiċi, bħal prodotti farmaċewtiċi, polimeri, ikel, xorb u prodotti petrokimiċi. L-għarfien, il-ħiliet u l-kompetenzi miksuba jagħtu lill-individwi l-opportunità biex jirnexxu fl-impjieg f’firxa wiesgħa ta’ industriji tal-manifattura u tal-ipproċessar, ta’ ditti ta’ konsulenza, mal-gvern, u ma’ istituzzjonijiet ta’ riċerka u edukattivi. Il-kors jesponi lill-istudenti għall-iżvilupp u d-disinn ta’ proċessi kimiċi fi skali differenti u joħloq pont bejn ix-xjenza u l-manifattura, bl-applikazzjoni tal-prinċipji tal-kimika u l-inġinerija biex jiġu solvuti problemi li jinvolvu l-produzzjoni jew l-użu ta’ sustanzi kimiċi. Il-programm jipprovdi wkoll opportunitajiet għall-istudenti biex jiffokaw fuq l-iżvilupp ta’ ħiliet ta’ livell ogħla f’kuntest xjentifiku u teknoloġiku."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Applied Science",
                    "2 A-Level Passes and 2 I-Level Passes"
                ],
                "req_compusolry": "A-Level Chemistry",
                "req_preferred": "I-or A-Level: Biology or Physics or Mathematics (Pure or Applied)",
                "req_other": "",
                "careers": [
                    "Senior laboratory analyst",
                    "Laboratory administrator",
                    "Validation specialist",
                    "Chemical plant administrator"
                ]
            },
            {
                "index": "01-10",
                "institute": "ias",
                "code": "AS6-02-19",
                "title": "Bachelor of Science (Honours) in Environmental Engineering",
                "desc_en": [
                    "The protection of natural resources, CO2 emissions, climate change and its effects, and demographic changes, are increasingly important topics in the local and international context. The programme merges classical engineering with natural sciences. Environmental engineering deals with engineering solutions for environmentally relevant challenges of our future. This course provides learners with the ability to use problem-solving approaches for dealing with ecological and technical challenges, in order to creatively arrive at a situation of resource sustainability. The course is a challenging, technically-oriented programme that offers learners a broad range of fields of application. Environmental engineers can be active in the planning, construction and operation of environmental technological facilities, in research and teaching, environmental organisations, administration, and consultancy businesses of their own."
                ],
                "desc_mt": [
                    "Il-protezzjoni tar-riżorsi naturali, l-emissjonijiet tas-CO2, it-tibdil fil-klima u l-effetti tiegħu, u t-tibdil demografiku, huma suġġetti li qed isiru dejjem aktar importanti fil-kuntest lokali u internazzjonali. Il-programm jgħaqqad l-inġinerija klassika max-xjenzi naturali. L-inġinerija ambjentali tittratta soluzzjonijiet tal-inġinerija għal sfidi ambjentali li se niffaċċjaw fil-futur. Dan il-kors iwassal biex l-istudenti jkunu kapaċi jsibu soluzzjonijiet li jindirizzaw sfidi ekologiċi u tekniċi bil-għan li tintlaħaq sitwazzjoni ta’ sostenibbiltà tar-riżorsi.",
                    "Il-kors huwa programm impenjattiv, orjentat lejn it-teknoloġija u joffri lill-istudenti firxa wiesgħa ta’ oqsma ta’ applikazzjoni. L-inġiniera ambjentali jistgħu jkunu attivi fl-ippjanar, fil-kostruzzjoni u l-operat ta’ faċilitajiet teknoloġiċi ambjentali, fir-riċerka u t-tagħlim, f’organizzazzjonijiet ambjentali, fl-amministrazzjoni u f’negozji ta’ konsulenza tagħhom stess."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Environmental Sustainability",
                    "MCAST Advanced Diploma in Applied Science",
                    "2 A-Level Passes and 2 I-Level Passes"
                ],
                "req_compusolry": "I-or A-Level Physics or Mathematics (Pure or Applied), Biology, Chemistry, Geography, Enviromental Studies",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Water project manager",
                    "Alternative energy manager",
                    "Environmental sales engineer",
                    "Environmental regulator"
                ]
            },
            {
                "index": "01-11",
                "institute": "ias",
                "code": "AS6-03-19",
                "title": "Bachelor of Science (Honours) in Health Sciences (Physiological Measurements)",
                "desc_en": [
                    "This degree programme is intended for learners who wish to pursue studies which will provide them with the appropriate competences for the measurement and imaging of the human body’s physiological activity. Scientists qualified in this field team up with various other health professionals and provide the diagnostic information which is vital to the medical profession in the treatment of several medical conditions. This three-year programme will provide the learner with the knowledge, clinical training and skills necessary to gain the professional qualifications required to work as a healthcare science practitioner in the area of clinical physiology."
                ],
                "desc_mt": [
                    "Dan il-programm li jwassal għal baċellerat huwa maħsub għall-istudenti li jixtiequ jkomplu bl-istudji tagħhom f’oqsma li jipprovdulhom il-kompetenzi xierqa biex jiksbu tagħrif dwar l-attività fiżjoloġika tal-ġisem tal-bniedem. Ix-xjentisti kwalifikati f’dan il-qasam jingħaqdu ma’ diversi professjonisti oħra fil-qasam tas-saħħa u jipprovdu l-informazzjoni dijanjostika li hija vitali għall-professjoni medika fir-rigward tat-trattament ta’ diversi kondizzjonijiet mediċi.",
                    "Dan il-programm ta’ tliet snin jipprovdi lill-istudent it-tagħrif, it-taħriġ kliniku u l-ħiliet neċessarji biex jikseb il-kwalifiki professjonali meħtieġa biex jaħdem bħala prattikant xjentifiku kkwalifikat fil-qasam tal-fiżjoloġija klinika."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma for Pharmacy Technicians",
                    "MCAST Advanced Diploma in Health Sciences",
                    "2 A-Level passes and 2 I-Level passes"
                ],
                "req_compusolry": "A-Level Biology",
                "req_preferred": "Chemistry, Physics",
                "req_other": "",
                "careers": [
                    "Health practitioner (physiological measurements)"
                ]
            },
            {
                "index": "01-12",
                "institute": "ias",
                "code": "AS6-04-20",
                "title": "Northumbria University Bachelor of Science (Honours) in Nursing Studies",
                "desc_en": [
                    "This Northumbria University programme offered in collaboration with MCAST provides learners with the necessary competences and qualifications required to register as a nurse (level 1) in Malta and across all EU member states. Learners will pursue a minimum of 2,300 hours of theoretical work and 2,300 hours of practical work (most of which is carried out on placement) as stipulated by EU directive 2005\/36\/EC, leading to a clinically skilled and compassionate nurse with professional values and who is fully capable of taking on accountable responsibility. Learners must successfully pass all theoretical and practical components of the course to be eligible for registration."
                ],
                "desc_mt": [
                    "Dan il-programm tal-Università ta’ Northumbria offrut b’kollaborazzjoni mal-MCAST jipprovdi lill-istudenti l-kompetenzi u l-kwalifiki neċessarji li huma meħtieġa biex jirreġistraw bħala infermiera (tal-ewwel livell) f’Malta u fl-Istati Membri kollha tal-UE. L-istudenti jkollhom minimu ta’ 2,300 siegħa ta’ ħidma teoretika u 2,300 siegħa ta’ ħidma prattika (li ħafna minnha ssir fuq il-post tax-xogħol) kif stipulat fid-Direttiva tal-UE 2005\/36\/KE, bil-għan li l-infermiera jkunu klinikament imħarrġa, juru kompassjoni, iħaddnu valuri professjonali u kapaċi jieħdu r-responsabbiltà fit-twettiq ta’ dmirijiethom. L-istudenti jridu jgħaddu mill-partijiet teoretiċi u prattiċi kollha tal-kors biex ikunu eliġibbli għar-reġistrazzjoni."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Health Sciences",
                    "MCAST Advanced Diploma for Pharmacy Technicians",
                    "2 A-Level passes and 2 I-Level passes"
                ],
                "req_compusolry": "",
                "req_preferred": "A-Levels: Biology, English, Psychology, Sociology, Chemistry\\nI-Levels: Chemistry, Mathematics, Sociology",
                "req_other": "Applicants will be subject to an occupational health screening and a values-based competitive interview to establish the suitability of candidates for nursing and that will ultimately act towards the final selection of candidates. Learners must also provide evidence of a clear criminal conduct.",
                "careers": [
                    "State registered nurse"
                ]
            },
            {
                "index": "01-13",
                "institute": "ias",
                "code": "AS6-05-20",
                "title": "Bachelor of Science (Honours) in Environmental Health",
                "desc_en": [
                    "Prospective learners following this programme will be dealing with the various, often inter-related, facets of environmental health that include: public health; environmental health and safety; food and water safety; health aspects relating to domestic, leisure and workplace environments, and the impact of these various factors on the individual and on society at large. Learners will gain the knowledge, skills and competences on how to assess, analyse, devise and implement efficient solutions to environmental health issues, with a view that successful candidates may be employed in advisory, enforcement or educational positions. They will also learn about current local policies and legal frameworks that oversee the governance of these environmental health factors."
                ],
                "desc_mt": [
                    "L-istudenti prospettivi li jsegwu dan il-programm jindirizzaw id-diversi aspetti, ħafna drabi relatati ma’ xulxin, tas-saħħa ambjentali li jinkludu: is-saħħa pubblika; is-saħħa u s-sikurezza ambjentali; is-sikurezza tal-ikel u tal-ilma; l-aspetti tas-saħħa relatati ma’ ambjenti domestiċi, ta’ divertiment u tal-post tax-xogħol, u l-impatt ta’ dawn id-diversi fatturi fuq l-individwu u fuq is-soċjetà inġenerali. L-istudenti jiksbu l-għarfien, il-ħiliet u l-kompetenzi dwar kif jivvalutaw, janalizzaw, ifasslu u jimplimentaw soluzzjonijiet effiċjenti fir-rigward ta’ kwistjonijiet ta’ saħħa ambjentali, bl-għan li l-kandidati li jtemmu l-kors b’suċċess ikunu jistgħu jsibu impjieg f’pożizzjonijiet ta’ konsulenza, ta’ infurzar jew fil-qasam tal-edukazzjoni. Huma se jitgħallmu wkoll dwar politiki lokali u oqfsa legali kurrenti li jissorveljaw il-governanza ta’ dawn il-fatturi ta’ saħħa ambjentali."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Health Sciences",
                    "MCAST Advanced Diploma in Environmental Sustainability",
                    "MCAST Advanced Diploma in Food Technology",
                    "MCAST Advanced Diploma in Applied Science",
                    "2 A-Level passes and 2 I-Level passes"
                ],
                "req_compusolry": "A-Level Biology",
                "req_preferred": "A-Levels: English, Chemistry\\nI-Levels: Chemistry, Mathematics",
                "req_other": "",
                "careers": [
                    "Environmental health officer"
                ]
            },
            {
                "index": "01-14",
                "institute": "ias",
                "code": "AG1-01-19",
                "title": "Introductory Certificate in Animal Husbandry and Horticultural Skills",
                "desc_en": [
                    "This basic programme of studies equips learners with a range of skills, enabling them to begin to understand what various land-based animal and crop activities involve.",
                    "The learner will have the opportunity to handle a variety of farm animals as well as work on crop fields and fruit trees. This course of studies includes topics about soil management, establishing crops, animal management, livestock nutrition and farm maintenance. Learners will have the opportunity to feed various animals such as rabbits and poultry, incubate eggs and hatch chicks whilst gaining the required hands-on experience in the horticulture and animal husbandry sector."
                ],
                "desc_mt": [
                    "Dan il-programm bażiku ta’ studji jipprovdi lill-istudenti firxa ta’ ħiliet, li permezz tagħhom huma jibdew jifhmu x’jinvolvu diversi attivitajiet tal-annimali u l-għelejjel.",
                    "L-istudent ikollu l-opportunità li jieħu ħsieb varjetà ta’ annimali tal-irziezet, kif ukoll li jaħdem fl-għelieqi tal-għelejjel u fuq is-siġar tal-frott. Dan il-kors ta’ studji jinkludi suġġetti dwar il-ġestjoni tal-ħamrija, l-istabbiliment ta’ għelejjel, il-ġestjoni tal-annimali, in-nutrizzjoni tal-bhejjem u l-manutenzjoni tal-irziezet. L-istudenti jkollhom l-opportunità li jagħlfu diversi annimali bħal fniek u tjur, jużaw l-inkubatur tal-bajd u jfaqqsu l-flieles, filwaqt li jiksbu l-esperjenza prattika meħtieġa tal-ortikultura u tat-trobbija tal-annimali."
                ],
                "mqf": 1,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assessment Tests (as may be applicable)",
                "careers": []
            },
            {
                "index": "01-15",
                "institute": "ias",
                "code": "AG1-02-18",
                "title": "Award in Agribusiness",
                "desc_en": [
                    "This programme of studies is intended for learners who would like to become familiar with the provision of general care to pet animals. Learners need to have a genuine interest for employability in posts related to animal care and agriculture. Learners will have the opportunity to delve into general animal care, including nutritional needs of various species of animals, differences in types of feeds and housing needs, how to recognise basic behavioural signs and how to handle different animals safely and humanely in line with animal welfare regulations. Learners will also be introduced to the basic principles of horticultural techniques and will therefore learn practical gardening skills such as the propagation of plants, basic plant care and irrigation set-up. Learners would also need to become familiar with the safe use and maintenance of hand tools and machinery."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji huwa maħsub għall-istudenti li jixtiequ jsiru familjari mal-kura ġenerali tal-annimali domestiċi. L-istudenti jeħtieġ li jkollhom interess ġenwin li jsibu impjieg f’pożizzjonijiet relatati mal-kura tal-annimali u l-agrikoltura. L-istudenti jkollhom l-opportunità jidħlu fil-fond fir-rigward tal-kura ġenerali tal-annimali, inklużi l-ħtiġijiet nutrizzjonali ta’ diversi speċi ta’ annimali, id-differenzi f’tipi ta’ għalf u l-ħtiġijiet ta’ abitazzjoni, kif jagħrfu sinjali bażiċi ta’ mġiba u kif jittrattaw annimali differenti b’mod sikur u uman, f’konformità mar-regolamenti dwar il-benesseri tal-annimali. L-istudenti jiġu introdotti wkoll għall-prinċipji bażiċi tat-teknika marbuta mal-ortikultura u għalhekk jiksbu ħiliet prattiċi ta’ ġardinaġġ, bħall-propagazzjoni tal-pjanti, il-kura bażika tal-pjanti u l-armar għat-tisqija. L-istudenti jeħtieġ ukoll li jsiru familjari mal-użu sikur u l-manutenzjoni ta’ għodod tal-idejn u makkinarju."
                ],
                "mqf": 1,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Provide the necessary documents including the Secondary School Certificate & Profile (SSC&P)\\nPresent a recent psychological report (issued no more than 3 years before the date of application) and school reports including the last Individual Education Plan (IEP)\\nAdaptation to both class-based and community-based learning to be ascertained through a 3 day workshop at MCAST, attendance for which is compulsory\\nCommitment to prospective employment\\nApplicants are asked to sit for an interview.",
                "careers": []
            },
            {
                "index": "01-16",
                "institute": "ias",
                "code": "AG2-01-19",
                "title": "Foundation Certificate in Horticulture and Animal Care",
                "desc_en": [
                    "This programme of studies is designed to equip learners with a range of basic skills and competences enabling them to become competent in various land-based activities related to the agricultural sector.",
                    "This programme of studies includes a significant amount of vocational practice that will provide a clear idea of the nature of the area that the learner may wish to follow in the future. Learners will have the opportunity to gain hands-on experience with farm animals, exotic animals and plants. Special focus will be given to soil, crop and animal management, livestock nutrition and farm maintenance."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji huwa mfassal biex jipprovdi lill-istudenti firxa ta’ ħiliet u kompetenzi bażiċi sabiex isiru kompetenti f’diversi attivitajiet li jinvolvu l-art u li huma relatati mas-settur agrikolu.",
                    "Dan il-programm ta’ studji jinkludi ammont sinifikanti ta’ prattika vokazzjonali li tagħti idea ċara tan-natura tal-qasam li l-istudent jista’ jkun jixtieq jinvolvi ruħu fih fil-futur. L-istudenti jkollhom l-opportunità li jiksbu esperjenza prattika ma’ annimali tal-irziezet, annimali eżotiċi u pjanti. Tingħata attenzjoni speċjali lill-ġestjoni tal-ħamrija, tal-għelejjel u tal-annimali, in-nutrizzjoni tal-bhejjem u l-manutenzjoni tal-irziezet."
                ],
                "mqf": 2,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education",
                    "MCAST Introductory Certificate"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assesment Tests (as may be applicable)",
                "careers": []
            },
            {
                "index": "01-17",
                "institute": "ias",
                "code": "AG3-01-19",
                "title": "Diploma in Animal Care",
                "desc_en": [
                    "This programme of studies offers an introduction to working with and handling farm animals and pets, and the necessary related hands-on experience. It provides the practical skills and background knowledge required to form a solid foundation in animal care. The learner will have the opportunity to acquire knowledge on various habitat designs that can be used for farm and pet animals as well as accommodation, study feeding procedures and how to identify and solve animal health problems. A learner who opts for this programme of studies will be expected to attend scheduled husbandry duties which form part of this course. This practical experience, coupled with motivation and responsibility, will back up the theoretical knowledge gained during lectures."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji joffri introduzzjoni għall-ħidma mal-annimali tal-irziezet u l-annimali domestiċi u t-trattament tagħhom, flimkien mal-esperjenza prattika relatata meħtieġa. Dan jipprovdi l-ħiliet prattiċi u l-għarfien bażiku biex tiġi ffurmata bażi soda fir-rigward tal-kura tal-annimali. L-istudent ikollu l-opportunità li jakkwista għarfien dwar diversi disinji ta’ abitazzjoni li jistgħu jintużaw għall-annimali tal-irziezet u l-annimali domestiċi, kif ukoll għall-akkomodazzjoni, li jistudja dwar il-proċeduri tal-għalf u kif jidentifika u jsolvi problemi tas-saħħa tal-annimali. Student li jagħżel li jsegwi dan il-programm ta’ studji se jkun mistenni jaqdi d-dmirijiet skedati tat-trobbija tal-annimali li jifformaw parti minn dan il-kors. Din l-esperjenza prattika, flimkien mal-motivazzjoni u r-responsabbiltà, se jsaħħu l-għarfien teoretiku li jkun kiseb matul il-lezzjonijiet."
                ],
                "mqf": 3,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "MCAST Foundation Certificate",
                    "2 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Animal groomer",
                    "Pet shop assistant",
                    "Animal care assistant"
                ]
            },
            {
                "index": "01-18",
                "institute": "ias",
                "code": "AG3-02-19",
                "title": "Diploma in Fish Husbandry",
                "desc_en": [
                    "This programme of studies introduces the learner to the basics of fish husbandry and provides the knowledge and skills required by the learner for eventual employment in related industries such as the fish farming and aquatics industries.",
                    "Being the only course in Malta that is solely dedicated to fish husbandry, this programme offers an excellent opportunity for employment in this industry, which has now become an important economic sector in the Maltese Islands.",
                    "The learner will develop the knowledge and practical skills needed, provided that one attends all the practical sessions which are vital to enhance the theoretical knowledge gained during lectures."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji jintroduċi lill-istudent għall-aspetti bażiċi tat-trobbija tal-ħut u jipprovdi l-għarfien u l-ħiliet meħtieġa biex eventwalment l-istudent isib impjieg f’industriji relatati, bħal dawk tat-trobbija tal-ħut u tal-akkwatika.",
                    "Billi huwa l-uniku kors f’Malta ddedikat biss għat-trobbija tal-ħut, dan il-programm joffri opportunità eċċellenti għal impjieg f’din l-industrija, li issa saret settur ekonomiku importanti fil-Gżejjer Maltin.",
                    "L-istudent jiżviluppa l-għarfien u l-ħiliet prattiċi meħtieġa, ladarba jattendi s-sessjonijiet prattiċi kollha li huma vitali biex jissaħħaħ l-għarfien teoretiku miksub matul il-lezzjonijiet."
                ],
                "mqf": 3,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "MCAST Foundation Certificate",
                    "2 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Fish farm assistant",
                    "Aquarium shop assistant"
                ]
            },
            {
                "index": "01-19",
                "institute": "ias",
                "code": "AG3-03-18",
                "title": "Diploma in Horticulture",
                "desc_en": [
                    "This programme of studies consists of four different modules: viticulture, floral design, gardening and nursery production, crop production and processing. Practical sessions and work experience form an integral part of the programme of studies, providing the learners with the required skills and competences to improve employment opportunities. The course also provides a good foundation for future career prospects in the respective fields as well as for progression to a more advanced qualification.",
                    "This programme also gives the learner the possibility to choose one’s own combination of different modules leading to certification of an award for each individual stand-alone module that the learner has successfully completed."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji jikkonsisti f’erba’ unitajiet differenti: il-vitikultura, id-disinn tal-fjuri, il-ġardinaġġ u t-tkabbir tal-pjanti, il-produzzjoni u l-ipproċessar tal-għelejjel. Sessjonijiet prattiċi u esperjenza ta’ xogħol jifformaw parti integrali mill-programm ta’ studji u jipprovdu lill-istudenti l-ħiliet u l-kompetenzi meħtieġa biex itejbu l-opportunitajiet tagħhom li jsibu impjieg. Il-kors jipprovdi wkoll bażi tajba għal prospetti ta’ karriera fl-oqsma rispettivi fil-futur, jew biex l-istudent ikompli jistudja f’livell aktar avvanzat.",
                    "Dan il-programm jagħti lill-istudent il-possibbiltà li jagħżel huwa stess il-kombinazzjoni ta’ unitajiet differenti, li jwasslu biex l-istudent jikseb ċertifikat ta’ għotja għal kull unità li jtemm b’suċċess."
                ],
                "mqf": 3,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "MCAST Foundation Certificate",
                    "2 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Plant nursery assistant",
                    "Horticulture farm\/greenhouse aide",
                    "Florist assistant",
                    "Viticulture attendant"
                ]
            },
            {
                "index": "01-20",
                "institute": "ias",
                "code": "AG4-01-19",
                "title": "Advanced Diploma in Animal Management and Veterinary Nursing",
                "desc_en": [
                    "This course of studies provides learners with a broad knowledge of the animal management and animal care industry, including veterinary nursing and assistance as well as studies in veterinary diagnostic techniques and livestock management.",
                    "The programme of studies offers a wide perspective on the latest practices in the animal management\/animal care sector as well as its interconnectivity with entrepreneurship and the related business sector.",
                    "Learners will be encouraged to relate theory to practice at all stages through assignments, projects, practical work and work placements. Scheduled practical livestock husbandry duties form an integral part of the curriculum."
                ],
                "desc_mt": [
                    "Dan il-kors ta’ studji jipprovdi lill-istudenti għarfien wiesa’ fir-rigward tal-industrija tal-ġestjoni u l-kura tal-annimali, inklużi l-infermerija u l-assistenza veterinarja, kif ukoll studji dwar it-teknika dijanjostika veterinarja u l-ġestjoni tal-bhejjem.",
                    "Il-programm ta’ studji joffri perspettiva wiesgħa dwar il-prattiċi l-aktar riċenti fis-settur tal-ġestjoni u l-kura tal-annimali, kif ukoll ir-rabta tiegħu mal-intraprenditorija u s-settur kummerċjali relatat.",
                    "L-istudenti jiġu mħeġġa jorbtu t-teorija mal-prattika fl-istadji kollha tal-kors permezz ta’ assignments, proġetti, ħidma prattika u esperjenzi ta’ xogħol. Id-dmirijiet skedati tat-trobbija prattika tal-bhejjem jifformaw parti integrali mill-kurrikulu."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Diploma in Fish Husbandry",
                    "MCAST Diploma in Animal Care",
                    "MCAST Diploma in Horticulture",
                    "MCAST Diploma in Applied Science",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Veterinary assistant",
                    "Veterinary nursing assistant",
                    "Farm operator",
                    "Animal sanctuary warden"
                ]
            },
            {
                "index": "01-21",
                "institute": "ias",
                "code": "AG4-02-19",
                "title": "Advanced Diploma in Fish Management",
                "desc_en": [
                    "This programme of studies offers learners a wide perspective of different aspects of fish management and will provide them with a broad knowledge and aptitude related to the fish husbandry sector and industry. Learners will acquire knowledge, skills and competences in both the farmed and ornamental fish husbandry industries. This programme of studies also exposes learners to key concepts related to wild stock fisheries management.",
                    "The programme will give an opportunity to learners to gain experience while learning new skills. They are constantly encouraged to relate theory to practice at all stages through assignments, projects, practical work and work placements. Scheduled fish husbandry duties form an integral part of the curriculum."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji joffri lill-istudenti perspettiva wiesgħa ta’ aspetti differenti tal-ġestjoni tal-ħut u jipprovdilhom għarfien u aptitudni wesgħin relatati mas-settur u l-industrija tat-trobbija tal-ħut. L-istudenti jakkwistaw l-għarfien, il-ħiliet u l-kompetenzi meħtieġa fl-industriji tat-trobbija tal-ħut, kemm dik tal-fish farms kif ukoll dik ornamentali. Dan il-programm ta’ studji jesponi wkoll lill-istudenti għal kunċetti ewlenin relatati mal-ġestjoni tas-sajd tal-ħut selvaġġ.",
                    "Il-programm jagħti opportunità lill-istudenti biex jiksbu esperjenza filwaqt li jitgħallmu ħiliet ġodda. Huma jiġu kontinwament imħeġġa li jorbtu t-teorija mal-prattika fl-istadji kollha tal-kors, permezz ta’ assignments, proġetti, ħidma prattika u esperjenzi ta’ xogħol. Id-dmirijiet skedati tat-trobbija prattika tal-annimali jifformaw parti integrali mill-kurrikulu."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Diploma in Fish Husbandry",
                    "MCAST Diploma in Animal Care",
                    "MCAST Diploma in Horticulture",
                    "MCAST Diploma in Applied Science",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Fish farm inspector",
                    "Aquaculture\/aquatic technician",
                    "Hatchery manager",
                    "Aquarium maintenance technician"
                ]
            },
            {
                "index": "01-22",
                "institute": "ias",
                "code": "AG4-03-20",
                "title": "Advanced Diploma in Horticulture",
                "desc_en": [
                    "This programme of studies provides learners with an understanding of the horticultural industry including crop management of a wide range of crops, an introduction to garden design, floristry, pest and nutrient management, and studies in rural development and agricultural policies.",
                    "The programme of studies offers a wide perspective on the latest technologies used in the agricultural sector as well as its interconnectivity with entrepreneurship and business and the hospitality sector in relation to garden design and agri-and ecotourism.",
                    "Learners will be encouraged to relate theory to practice at all stages of learning through assignments, projects and practical work. Scheduled practical crop husbandry duties form an integral part of the curriculum."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji jipprovdi lill-istudenti fehim dwar l-industrija tal-ortikultura, inkluż il-ġestjoni ta’ firxa wiesgħa ta’ għelejjel, id-disinn tal-ġonna (introduzzjoni), il-produzzjoni u l-bejgħ tal-fjuri, il-ġestjoni tal-pesti u tan-nutrizzjoni, u studji dwar il-politika dwar l-iżvilupp rurali u l-agrikoltura.",
                    "Il-programm ta’ studji joffri perspettiva wiesgħa dwar it-teknoloġiji l-aktar riċenti użati fis-settur agrikolu, kif ukoll ir-rabta tiegħu mal-intraprenditorija u s-setturi kummerċjali tal-ospitalità fir-rigward tad-disinn tal-ġonna, l-agrituriżmu u l-ekoturiżmu.",
                    "L-istudenti jiġu mħeġġa jorbtu t-teorija mal-prattika fl-istadji kollha tal-kors permezz ta’ assignments, proġetti, u ħidma prattika. Id-dmirijiet skedati fil-kura prattika tal-għelejjel jifformaw parti integrali mill-kurrikulu."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Diploma in Fish Husbandry",
                    "MCAST Diploma in Animal Care",
                    "MCAST Diploma in Horticulture",
                    "MCAST Diploma in Applied Science",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Horticulture inspector",
                    "Garden design assistant",
                    "Vegetable\/fruit grower",
                    "Rural development operator"
                ]
            },
            {
                "index": "01-23",
                "institute": "ias",
                "code": "AG6-01-19",
                "title": "Bachelor of Science (Honours) in Animal Management and Veterinary Nursing",
                "desc_en": [
                    "This Bachelor’s degree aims at providing learners with the opportunity to specialise in a main area of study with the aim of seeking employment at management level or similar. This may relate to animal welfare, production, education, veterinary services, research and development, and regulatory services both locally and internationally.",
                    "The programme of studies offers the required knowledge, skills and competences related to animal health and nutrition, welfare, ecology, philosophy, ethics and law. Learners will also undertake a research project whereby they will be expected to select a topic for investigation following an established methodology."
                ],
                "desc_mt": [
                    "Dan il-kors, li jwassal għal baċellerat, għandu l-għan li jipprovdi lill-istudenti l-opportunità li jispeċjalizzaw f’qasam ta’ studji prinċipali, bl-għan li jsibu impjieg f’livell maniġerjali jew simili. Dan jista’ jkun jirrigwarda l-benesseri tal-annimali, il-produzzjoni, l-edukazzjoni, is-servizzi veterinarji, ir-riċerka u l-iżvilupp, u s-servizzi regolatorji, kemm lokalment kif ukoll internazzjonalment.",
                    "Il-programm ta’ studji joffri l-għarfien, il-ħiliet u l-kompetenzi meħtieġa relatati mas-saħħa u n-nutrizzjoni tal-annimali, il-benesseri, l-ekoloġija, il-filosofija, l-etika u l-liġi. L-istudenti jwettqu wkoll proġett ta’ riċerka li għalih ikunu mistennija jagħżlu suġġett biex jinvestigawh billi jsegwu metodoloġija stabbilita."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Animal Management and Veterinary Nursing",
                    "MCAST Advanced Diploma in Fish Management",
                    "MCAST Advanced Diploma in Horticulture",
                    "2 A-Level passes and 2 I-Level passes"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Animal clinic manager",
                    "Animal welfare officer",
                    "Farm manager",
                    "Nutritional adviser"
                ]
            },
            {
                "index": "01-24",
                "institute": "ias",
                "code": "AG6-02-19",
                "title": "Bachelor of Science (Honours) in Horticulture",
                "desc_en": [
                    "This programme gives learners skills in the latest horticultural practices with the use of modern technology.",
                    "Learners will have the opportunity to study and practise different aspects related to their main area of study, with the aim of seeking employment at management level in private enterprise, in research and development and\/or in regulatory services both locally and internationally.",
                    "This programme offers the required knowledge and competences related to Sustainable Land Use, Integrated Pest Management, Plant Nutrition and Fertilisation, Agricultural Technology, Rural Development and Garden Design\/Landscaping.",
                    "During this course students need to undertake a research project whereby a topic is chosen and subsequently investigated, researched, a methodology formulated and data collected, analysed and discussed."
                ],
                "desc_mt": [
                    "Dan il-programm jagħti lill-istudenti ħiliet fil-prattiċi ortikulturali l-aktar riċenti bl-użu ta’ teknoloġija moderna.",
                    "L-istudenti jkollhom l-opportunità li jistudjaw u jipprattikaw aspetti differenti relatati mal-qasam prinċipali tal-istudju tagħhom, bl-għan li jsibu impjieg fil-livell maniġerjali fl-intrapriża privata, fir-riċerka u l-iżvilupp u\/jew fis-servizzi regolatorji, kemm lokalment kif ukoll barra mill-pajjiż.",
                    "Dan il-programm joffri l-għarfien u l-kompetenzi meħtieġa relatati mal-Użu Sostenibbli tal-Art, il-Ġestjoni Integrata tal-Pesti, in-Nutrizzjoni u l-Fertilizzazzjoni tal-Pjanti, it-Teknoloġija Agrikola, l-Iżvilupp Rurali u d-Disinn tal-Ġonna\/il-Pajsaġġ.",
                    "Matul dan il-kors l-istudenti jkunu meħtieġa li jaħdmu fuq proġett ta’ riċerka, fejn jagħżlu suġġett sabiex jinvestigawh, jagħmlu riċerka fuqu, jifformulaw metodoloġija, jiġbru d-data, janalizzawha u jiddiskutuha."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Fish Management",
                    "MCAST Advanced Diploma in Animal Management and Veterinary Nursing",
                    "MCAST Advanced Diploma in Horticulture",
                    "2 A-Level passes and 2 I-Level passes"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Farm advisory services provider",
                    "Professional landscaper",
                    "Garden designer",
                    "EU\/national regulatory control manager"
                ]
            },
            {
                "index": "01-25",
                "institute": "ias",
                "code": "AG6-03-19",
                "title": "Bachelor of Science (Honours) in Fish Management",
                "desc_en": [
                    "This programme of studies provides learners with a very thorough understanding of aquaculture and fisheries sciences and includes a wide range of aspects that will give them a better understanding of these sectors which are so important to the economy of the Maltese Islands.",
                    "The study-units revolve around the aquaculture and fisheries sciences and relate to the production and management of aquaculture facilities, giving a better understanding of the highly complex field of fisheries. This programme of studies is intended for those who want to delve deeper into the fish management sciences and who want to start a career in this sector."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji jipprovdi lill-istudenti għarfien dettaljat tax-xjenzi tal-akkwakultura u s-sajd u jinkludi firxa wiesgħa ta’ aspetti li jgħinuhom jifhmu aħjar dawn is-setturi li huma tant importanti għall-ekonomija tal-Gżejjer Maltin.",
                    "L-unitajiet ta’ studju jduru madwar ix-xjenzi tal-akkwakultura u s-sajd u jirrigwardaw il-produzzjoni u l-ġestjoni ta’ faċilitajiet tal-akkwakultura, biex l-istudenti jkunu jistgħu jifhmu aħjar il-qasam ferm kumpless tas-sajd. Dan il-programm ta’ studji huwa maħsub għal dawk li jixtiequ jidħlu aktar fil-fond fix-xjenzi tal-ġestjoni tas-sajd u li għaldaqstant jixtiequ jibdew karriera f’dan is-settur."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Animal Management and Veterinary Nursing",
                    "MCAST Advanced Diploma in Fish Management",
                    "MCAST Advanced Diploma in Horticulture",
                    "2 A-Level passes and 2 I-Level passes"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Jobs related to the Aquaculture and Fisheries sectors"
                ]
            }
        ]
    },
    {
        "code": "ibmc",
        "color": "#db0642",
        "name_en": "Institute of Business Management & Commerce",
        "desc_en": "Offering a range of courses at MQF Levels 1 to 7, the Institute has different courses from generic to more specific ones targeted at more specific careers. The main areas of Business are covered through the different courses, ranging from Financial Services and Insurance to Marketing and Procurement. At the lower levels courses are of a generic nature to offer learners the opportunity to get a good idea of different sectors. The course content becomes more specific across the spectrum of studies, helping learners attain a better focus on the career path they would like to embark upon. An integral characteristic of VET is that different programmes of study help learners benefit thoroughly from different forms of industry experience.",
        "name_mt": "",
        "desc_mt": "Minbarra li joffri firxa ta’ korsijiet fil-Livelli tal- MQF 1 sa 7, l-Istitut għandu korsijiet differenti li jvarjaw minn dawk ġeneriċi għal oħrajn aktar speċifiċi, immirati lejn karrieri aktar speċifiċi. L-oqsma ewlenin tan-Negozju huma koperti permezz ta’ korsijiet differenti, li jvarjaw mis- Servizzi Finanzjarji u l-Assigurazzjoni għall- Kummerċjalizzazzjoni u l-Akkwist. Fil-livelli aktar baxxi, il-korsijiet huma ta’ natura ġenerika biex joffru lill-istudenti l-opportunità li jiksbu ħjiel tajjeb tas-setturi differenti. Il-kontenut isir aktar speċifiku mal-medda tal-kors u dan jgħin lill-istudenti jiksbu idea aktar ċara tal-karriera li jixtiequ jaqbdu. Karatteristika integrali tal-VET hija li programmi ta’ studju differenti jgħinu lill-istudenti jibbenefikaw bis-sħiħ minn forom differenti ta’ esperjenza fl-industrija.",
        "courses": [
            {
                "index": "02-01",
                "institute": "ibmc",
                "code": "BC1-02-19",
                "title": "Award in Basic Office Skills",
                "desc_en": [
                    "This programme provides the learners with a hands-on experience to gain the basic skills required to work in an office environment. Learners need to have a genuine interest to work in posts related to basic customer care and office work. The course tackles both the use of basic office equipment as well as the soft skills required to be able to behave in an appropriate manner in an office environment."
                ],
                "desc_mt": [
                    "Dan il-programm jipprovdi lill-istudenti esperjenza prattika biex jiksbu l-ħiliet bażiċi meħtieġa biex jaħdmu f’ambjent ta’ uffiċċju. L-istudenti jeħtieġ li jkollhom interess ġenwin li jaħdmu f’postijiet relatati ma’ assistenza bażika tal-klijenti u xogħol tal-uffiċċju. Il-kors jittratta kemm l-użu ta’ tagħmir bażiku tal-uffiċċju, kif ukoll il-ħiliet personali meħtieġa biex wieħed ikun jista’ jġib ruħu kif xieraq f’ambjent ta’ uffiċċju."
                ],
                "mqf": 1,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assessment Tests and\/or Interview (as may be applicable)",
                "careers": [
                    "Assistant in office environment"
                ]
            },
            {
                "index": "02-02",
                "institute": "ibmc",
                "code": "BC1-03-18",
                "title": "Award in Hospitality",
                "desc_en": [
                    "Through this award programme, learners will start to become familiar with the hospitality industry, as well as have the opportunity to identify such industries, locally and abroad. Different roles and duties found within the hospitality industry will be explored, as will be the understanding of the hierarchy and responsibility one would have to deal with in such roles.",
                    "Learners will also discuss and understand the importance of hygiene at work, including personal hygiene, as well as the importance of keeping safe and working in a safe and healthy environment. This would also include being ethical and using adequate etiquette."
                ],
                "desc_mt": [
                    "Permezz ta’ dan il-programm ta’ għotja, l-istudenti jibdew isiru familjari mal-industrija tal-ospitalità, kif ukoll ikollhom l-opportunità li jidentifikaw dawn l-industriji, kemm lokalment kif ukoll barra mill-pajjiż. Huma jesploraw ir-rwoli u d-dmirijiet differenti marbuta mal-industrija tal-ospitalità, kif ukoll jitgħallmu dwar il-ġerarkija u r-responsabbiltà li wieħed ikollu jiffaċċja f’dawn ir-rwoli.",
                    "L-istudenti jiddiskutu u jifhmu wkoll l-importanza tal-iġjene fuq il-post tax-xogħol, inkluża l-iġjene personali, kif ukoll l-importanza li wieħed iżomm ruħu ‘l bogħod mill-periklu u li jaħdem f’ambjent sikur u tajjeb għas-saħħa. Dan ikun jinkludi wkoll l-etika u l-użu ta’ manjieri tajbin."
                ],
                "mqf": 1,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education, documented by the SSC&P (Secondary School Certificate and Profile)"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Applicants are required to: Present a recent psychological report (issued no more than 3 years before date of application) and school reports including most recent Individual Education Plan (IEP)\\nAdapt to both class-based and community-based learning (to be ascertained through a 3-day workshop at MCAST, attendance for which is compulsory)\\nCommitment to prospective employment",
                "careers": [
                    "Assistant in kitchen",
                    "Assistant in restaurant",
                    "Assistant in housekeeping"
                ]
            },
            {
                "index": "02-03",
                "institute": "ibmc",
                "code": "BC1-04-18",
                "title": "Award in Retail",
                "desc_en": [
                    "This programme is intended for learners who would like to become familiar with the local retailing sector, in particular small retail shops. Learners who apply for this course need to be genuinely interested and willing to work in a post related to the retail sector. Learners will become familiar with the basic business concepts, including the principles of stock management. They will also be made aware of different types of customers and situations that people who work in a retail environment would typically face. To achieve this, learners will be exposed to the importance of, and the skills required for good communication, as well as teamwork."
                ],
                "desc_mt": [
                    "Dan il-programm huwa maħsub għall-istudenti li jixtiequ jsiru familjari mas-setturi lokali ta’ bejgħ għall-konsumatur, b’mod partikolari ħwienet żgħar. L-istudenti li japplikaw għal dan il-kors jeħtieġ li jkollhom interess ġenwin u li jkunu lesti li jaħdmu f’post relatat mas-settur tal-bejgħ għall-konsumatur. L-istudenti jsiru familjari mal-kunċetti bażiċi tan-negozju, inklużi l-prinċipji tal-immaniġġjar tal-istokk. Huma jsiru konxji wkoll dwar it-tipi differenti ta’ konsumaturi u sitwazzjonijiet li normalment jiffaċċjaw il-persuni li jaħdmu f’ambjent ta’ bejgħ għall-konsumatur. Għal dan il-għan, l-istudenti jsiru konxji mill-importanza ta’ komunikazzjoni tajba u l-ħiliet meħtieġa biex din isseħħ, kif ukoll mill-importanza ta’ ħidma f’tim."
                ],
                "mqf": 1,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education, documented by the SSC&P (Secondary School Certificate and Profile)\\nApplicants are required to:\\nPresent a recent psychological report (issued no more than 3 years before the date of application) and school reports including most recent Individual Education Plan (IEP)\\nAdapt to both class-based and community-based learning (to be ascertained through a 3-day workshop at MCAST, attendance for which is compulsory)\\nCommitment to prospective employment"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Sit for an Interview -as may be applicable",
                "careers": [
                    "Shop assistant",
                    "Store assistant"
                ]
            },
            {
                "index": "02-04",
                "institute": "ibmc",
                "code": "BC1-01-19",
                "title": "Introductory Certificate in Business",
                "desc_en": [
                    "The programme is aimed at learners who would like to explore the world of studying business related subjects. During the programme, learners will be exposed to the basics of business concepts including organisational structures and different business areas. The course will also provide learners with skills related to subjects such as English, Maths and Maltese as well as other key skills units which will help them in their progression towards further studies."
                ],
                "desc_mt": [
                    "Il-programm huwa mmirat għall-istudenti li jixtiequ jesploraw id-dinja tal-istudju ta’ suġġetti relatati man-negozju. Matul il-programm, l-istudenti se jiltaqgħu mal-kunċetti bażiċi tan-negozju, inklużi strutturi organizzattivi u oqsma differenti tan-negozju. Il-kors se jipprovdi wkoll lill-istudenti l-ħiliet relatati ma’ suġġetti bħall-Ingliż, il-Matematika u l-Malti, kif ukoll unitajiet ta’ ħiliet ewlenin oħra li jgħinuhom jimxu ‘l quddiem biex ikunu jistgħu jkomplu jistudjaw."
                ],
                "mqf": 1,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assessment Tests and\/or Interview (as may be applicable)",
                "careers": [
                    "Office assistant",
                    "Shop assistant"
                ]
            },
            {
                "index": "02-05",
                "institute": "ibmc",
                "code": "BC2-01-19",
                "title": "Foundation Certificate in Business",
                "desc_en": [
                    "This programme provides learners with an introduction to business related topics such as Basic Bookkeeping, Human Resources, Marketing, Sales and General Business Concepts. These different topics are introduced at a basic level through a variety of teaching methods as well as assessment techniques with the aim of catering for different learning styles."
                ],
                "desc_mt": [
                    "Dan il-programm jipprovdi lill-istudenti introduzzjoni għal suġġetti relatati man-negozju, bħall-Bookkeeping, ir-Riżorsi Umani, il-Marketing, il-Bejgħ u Kunċetti Ġenerali tan-Negozju. Dawn is-suġġetti differenti huma introdotti f’livell bażiku permezz ta’ varjetà ta’ metodi ta’ tagħlim, kif ukoll modi ta’ valutazzjoni differenti, bil-għan li jittieħdu inkunsiderazzjoni l-istili differenti ta’ kif wieħed jitgħallem."
                ],
                "mqf": 2,
                "duration": 1,
                "study": "FT",
                "mode": "Job Shadowing",
                "req_entry": [
                    "Finished Compulsory Education",
                    "MCAST Introductory Certificate"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assessment Tests (as may be applicable)",
                "careers": [
                    "Clerical assistant"
                ]
            },
            {
                "index": "02-06",
                "institute": "ibmc",
                "code": "BC3-01-19",
                "title": "Diploma in Business",
                "desc_en": [
                    "This programme is aimed at preparing learners to further their studies in different areas of business. It is a preparatory course for those wishing to further their studies at MCAST on to MQF Level 4. The course aims to allow learners to improve in the areas of written and spoken English and Maltese as well as in their Mathematical and IT skills. The course however also goes into more detail, while starting from the very basics of different business areas and functions such as Accounts, Human Resources, Marketing, Purchasing, and others. This generic background allows the students to bring their academic level up to scratch, while acquiring enough knowledge about the different business areas to be able to progress onto further studies."
                ],
                "desc_mt": [
                    "Dan il-programm huwa mmirat lejn it-tħejjija ta’ studenti biex ikomplu l-istudji tagħhom f’oqsma differenti tan-negozju. Huwa kors preparatorju biex wieħed ikompli l-istudji tiegħu fl-MCAST sal-Livell 4 tal-MQF. Il-kors għandu l-għan li jgħin lill-istudenti jtejbu l-ħiliet tagħhom fl-oqsma tal-kitba u t-taħdit bl-Ingliż u bil-Malti, kif ukoll il-ħiliet tagħhom fil-Matematika u l-IT. Madankollu, il-kors jidħol ukoll f’ħafna aktar dettall, filwaqt li jibda mill-kunċetti verament bażiċi ta’ oqsma u funzjonijiet differenti tan-negozju bħall-Accounts, ir-Riżorsi Umani, il-Marketing, ix-Xiri u oħrajn. Dan l-isfond ġeneriku jippermetti lill-istudenti jtejbu l-livell akkademiku tagħhom sa standard aċċettabbli, filwaqt li jiksbu biżżejjed għarfien dwar l-oqsma differenti tan-negozju sabiex ikunu jistgħu jkomplu jistudjaw f’livell aktar avvanzat."
                ],
                "mqf": 3,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "MCAST Foundation Certificate",
                    "2 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "Business Studies",
                "req_other": "",
                "careers": [
                    "Clerical assistant",
                    "Shop cashier"
                ]
            },
            {
                "index": "02-07",
                "institute": "ibmc",
                "code": "BC4-A1-19",
                "title": "Advanced Diploma in Business Administration",
                "desc_en": [
                    "This programme will allow learners to study the different areas of business administration. It is aimed either at students who aspire to one day open up their own business or follow in their family business, or else to work in the administration of a company at a junior level. This generic course offers a good basis into the main areas of business administration including office administration, accounts, marketing, recruitment, and health and safety among others. The course, which is assessed through a variety of scenario related assessments, also sees learners go out on Apprenticeship where a holistic hands-on and practical approach is adopted."
                ],
                "desc_mt": [
                    "Dan il-programm jippermetti lill-istudenti jistudjaw l-oqsma differenti tal-amministrazzjoni tan-negozju. Il-kors huwa mmirat lejn studenti li jaspiraw li xi darba jiftħu n-negozju tagħhom jew li jkomplu jmexxu n-negozju tal-familja tagħhom, jew inkella jixtiequ li jaħdmu fl-amministrazzjoni ta’ kumpanija mhux f’livell għoli. Dan il-kors ġeneriku joffri bażi tajba fl-oqsma ewlenin tal-amministrazzjoni tan-negozju, inklużi l-amministrazzjoni tal-uffiċċju, l-accounts, il-marketing, ir-reklutaġġ, u s-saħħa u s-sigurtà, fost l-oħrajn. Il-kors, li huwa vvalutat permezz ta’ varjetà ta’ metodi ta’ valutazzjoni relatati max-xenarju, jipprovdi wkoll Apprendistat għall-istudenti biex hekk jiksbu esperjenza prattika."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Apprenticeship",
                "req_entry": [
                    "MCAST Diploma in Business",
                    "MCAST Diploma in Postal Services",
                    "MCAST Diploma in Foundation Studies for Security, Enforcement and Protection",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "English Language, Mathematics",
                "req_other": "",
                "careers": [
                    "Clerk",
                    "Administrative assistant",
                    "Human resource assistant",
                    "Front office coordinator",
                    "Purchasing officer",
                    "Field research officer",
                    "Supply chain \/ Logistics officer"
                ]
            },
            {
                "index": "02-08",
                "institute": "ibmc",
                "code": "BC4-A2-20",
                "title": "Advanced Diploma in Finance and Insurance",
                "desc_en": [
                    "This course is aimed at people who would like to venture in one of the many careers related to financial services. The first year of studies introduces learners to generic areas of financial services including the world of insurance. In the second year of studies, learners will then choose an area of specialisation. Specialisation can be either in financial services or else in insurance.",
                    "This approach ensures that any learner following this course is exposed to different areas of the financial services world, thus giving them better flexibility in career prospects. Learners choosing the main area of expertise will be very strong in the specific area chosen, while having a good understanding of the other area."
                ],
                "desc_mt": [
                    "Dan il-kors huwa mmirat għal studenti prospettivi li qegħdin jaspiraw għal karriera fid-dinja tas-Servizzi Finanzjarji. L-ewwel sena tal-kors hija maħsuba biex tintroduċi lill-istudenti għas-setturi differenti tal-industrija tas-servizzi finanzjarji, inkluż l-assigurazzjoni. Fit-tieni sena tal-kors, l-istudenti jagħżlu li jispeċjalizzaw jew fil-qasam tas-servizzi finanzjarji u bankarji jew inkella fl-istudji tal-assigurazzjoni.",
                    "B’dan il-mod, fl-ewwel sena l-istudenti jieħdu bażi soda tal-aspetti u l-oqsma kollha tas-servizzi finanzjarji u għaldaqstant ikollhom aktar flessibbiltà mil-lat ta’ impjiegi. Permezz tal-għażla ta’ speċjalizzazzjoni fit-tieni sena, l-istudenti jieħdu għarfien aktar fil-fond fis-settur tal-għażla tagħhom filwaqt li jkollhom għarfien adegwat fis-setturi l-oħra."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Apprenticeship",
                "req_entry": [
                    "MCAST Diploma in Business",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "English Language, Mathematics",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "In an Insurance setting:",
                    " Account handler",
                    "Claims handler",
                    "Insurance claims surveyor",
                    "Insurance clerk In a Financial Services setting:",
                    " Bank cashier",
                    "Clerical and other officer roles within banks and other financial services institutions"
                ]
            },
            {
                "index": "02-09",
                "institute": "ibmc",
                "code": "BC4-A3-19",
                "title": "Advanced Diploma in Accounting",
                "desc_en": [
                    "This programme aims to give learners a very good grounding in the studying of Accounts. Study areas range from aspects of financial management accounting to the use of accounting software and more generic areas of key skills. The course includes hands-on experience through Apprenticeship where students will learn by doing and gain experience first-hand on the application of the theory. Students who finish the course will not be qualified accountants, but will have a very good understanding and possess the required skills to work in an accounts department. Learners following this programme will also be prepared to sit for AAT (Association of Accounting Technicians) UK International Examinations."
                ],
                "desc_mt": [
                    "Dan il-programm għandu l-għan li jipprovdi lill-istudenti bażi tajba ħafna fl-istudju tal-Accounts. L-oqsma tal-istudju jinkludu l-aspetti differenti ta’ accounting finanzjarju u ta’ mmaniġġjar, l-użu ta’ softwer tal-accounting, kif ukoll oqsma aktar ġeneriċi ta’ ħiliet ewlenin. Il-kors għandu livell għoli ħafna ta’ esperjenza prattika permezz ta’ Apprendistat, fejn l-istudenti mhux biss jitgħallmu permezz tal-prattika, iżda anke jesperjenzaw l-applikazzjoni diretta tat-teorija li jkunu qed jitgħallmu fil-klassi. Għalkemm l-istudenti li jlestu l-kors ma jkunux accountants kwalifikati b’mod sħiħ, żgur se jkollhom fehim tajjeb ħafna, flimkien mal-ħiliet meħtieġa biex jaħdmu f’dipartiment tal-accounts. L-istudenti li jsegwu dan il-programm se jitħejjew ukoll biex jagħmlu l-Eżamijiet Internazzjonali tal-AAT (Association of Accounting Technicians) UK."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Apprenticeship",
                "req_entry": [
                    "MCAST Diploma in Business",
                    "MCAST Diploma in Postal Services",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes Compulsory: English Language, Mathematics"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Fees: There are AAT fees payable to AAT (UK) for Membership and Examinations leading to Qualification Certificates awarded by AAT (UK).\\n Miżati: Hemm miżati tal-AAT li għandhom jitħallsu lill-AAT (UK) għal Sħubija u Eżamijiet li jwasslu għal Ċertifikati ta’ Kwalifika mogħtija minn AAT (UK).",
                "careers": [
                    "Accounts clerk",
                    "Accounts administrator",
                    "Audit assistant",
                    "Credit management officer"
                ]
            },
            {
                "index": "02-10",
                "institute": "ibmc",
                "code": "BC4-A5-18",
                "title": "Advanced Diploma in Marketing",
                "desc_en": [
                    "This programme is aimed at giving learners the knowledge and knowhow of the main areas related to the different areas of marketing. They will go into the areas of Marketing, Sales, Advertising, Public Relations and Customer Care in some detail. The insight in these different areas provides the student with the ability to work in different areas of marketing. The learner will also have the opportunity to apply the theory learned in class in practice through the Apprenticeship placement."
                ],
                "desc_mt": [
                    "Dan il-programm għandu l-għan li jipprovdi lill-istudenti l-għarfien u l-kompetenza fir-rigward tal-oqsma ewlenin relatati mal-oqsma differenti tal-marketing. L-istudenti se jidħlu f’ċertu dettall fl-oqsma tal-Marketing, il-Bejgħ, ir-Reklamar, ir-Relazzjonijiet Pubbliċi u l-Assistenza tal-Klijenti. Il-ħiliet f’dawn l-oqsma differenti jwasslu lill-istudent sabiex ikun kapaċi jaħdem f’’oqsma differenti tal-marketing. Permezz tal-Apprendistat, l-istudent se jkollu wkoll l-opportunità li japplika fil-prattika t-teorija li jkun tgħallem fil-klassi."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Apprenticeship",
                "req_entry": [
                    "MCAST Diploma in Business",
                    "MCAST Diploma in Postal Services",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "English Language",
                "req_preferred": "Maltese",
                "req_other": "",
                "careers": [
                    "Brand\/sales executive",
                    "Customer care coordinator",
                    "Marketing assistant",
                    "Media officer",
                    "Public relations officer",
                    "Sales representative",
                    "Selling and sales coordinator"
                ]
            },
            {
                "index": "02-11",
                "institute": "ibmc",
                "code": "BC4-A6-19",
                "title": "Advanced Diploma in Administrative and Secretarial Studies",
                "desc_en": [
                    "This programme is designed to enable learners to understand the key areas of administration, administrative services, office equipment and supplies, routine procedures, standards and the work environment. It is also designed to provide learners with the possibility of opting to delve deeper into one of two specific areas, namely Medical Secretaries and Legal Secretaries, as well as the application of Italian and French within a business related usage. The programme of studies has a very high level of hands-on experience through Apprenticeship, where learners will not only be learning by doing, but will also experience first-hand the application of the theory they would be learning in class."
                ],
                "desc_mt": [
                    "Dan il-programm huwa mfassal biex jgħin lill-istudenti jifhmu l-oqsma ewlenin tal-amministrazzjoni, is-servizzi amministrattivi, it-tagħmir u l-provvisti tal-amministrazzjoni, il-proċeduri ta’ rutina, l-istandards u l-ambjent tax-xogħol. Huwa mfassal ukoll biex jipprovdi lill-istudenti l-possibbiltà li jagħżlu li jidħlu aktar fil-fond f’wieħed minn żewg oqsma speċifiċi, jiġifieri Segretarji Mediċi u Segretarji Legali, kif ukoll l-applikazzjoni tat-Taljan u l-Franċiż f’kuntest relatat man-negozju. Il-programm ta’ studji għandu livell għoli ta’ esperjenza prattika permezz tal-Apprendistat, fejn l-istudenti mhux biss jitgħallmu permezz tal-prattika, iżda anke jesperjenzaw l-applikazzjoni diretta tat-teorija li jkunu qed jitgħallmu fil-klassi."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Apprenticeship",
                "req_entry": [
                    "MCAST Diploma in Business",
                    "MCAST Diploma in Postal Services",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "Maltese and English Language",
                "req_preferred": "Mathematics",
                "req_other": "Students opting for the Medical Stream need to be in possession of a: MCAST Diploma in Health and Social Care with at least 4 units at Grade B or better || 4 SEC\/O-Level\/SSC&P (Level 3) passes Compulsory: Maltese, English Language and One subject from Chemistry, Physics, Biology Preferred: Mathematics",
                "careers": [
                    "Secretary",
                    "Office administrator",
                    "Clerk",
                    "Personal assistant"
                ]
            },
            {
                "index": "02-12",
                "institute": "ibmc",
                "code": "BC4-A1-20",
                "title": "Advanced Diploma in Retail",
                "desc_en": [
                    "Learners will be exposed to the different aspects and career opportunities related to retail including front line, logistics, purchasing, retail operations and visual merchandising as an example. The retail industry in Malta is one of the largest industries and offers career opportunities with both local as well as international chains.",
                    "Learners will be covering all aspects of the retail environment including Stock Presentation, Customer Care, Buying, Visual Merchandising and Consumer Behaviour. Throughout this course, which is on Apprenticeship, learners will be studying on a dual system whereby they will have days at school, and days out working in industry."
                ],
                "desc_mt": [
                    "L-istudenti ħa jkunu esposti għal aspetti differenti u opportunitajiet ta’ karrieri relatati mal-industrija tal-bejgħ għall-konsumatur. Bħala eżempju, dawn jinkludu l-ewwel kuntatt, il-loġistika, ix-xiri, l-operat u l-kummerċjalizzazzjoni vizwali. Is-settur tal-bejgħ f’Malta huwa wieħed mill-ikbar industriji u joffri opportunitajiet ta’ xogħol ma’ azjendi lokali jew internazzjonali.",
                    "L-istudenti ħa jkunu qed jistudjaw l-aspetti kollha li jinkludu l-Preżentazzjoni tal-Istokk, l-Assistenza ta’ Klijenti, ix-Xiri, il-Kummerċjalizzazzjoni Viżiva u l-Imġiba tal-Konsumaturi. Matul dan il-kors, li qed jigi offrut fuq bazi ta’ Apprendistat, l-istudenti ħa jistud-jaw b’sistema ‘dual’ fejn iqattgħu ġranet l-iskola u oħrajn fuq il-post tax-xogħol."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Apprenticeship",
                "req_entry": [
                    "MCAST Level 3 Diploma",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "Mathematics, English Language",
                "req_other": "",
                "careers": [
                    "Shop supervisor",
                    "Visual merchandiser"
                ]
            },
            {
                "index": "02-13",
                "institute": "ibmc",
                "code": "BC5-01-19",
                "title": "Higher Diploma for Accounting Technicians",
                "desc_en": [
                    "This course builds upon the MCAST Advanced Diploma in Accounting and offers learners the possibility to become members of the Association of Accounting Technicians (UK). During this programme, the learners will continue to broaden and deepen their studies in the different areas of accounting including Financial and Management Accounting as well as Management and Business Law.",
                    "Learners who successfully complete the AAT (UK) Advanced Diploma in Accounting as well as the AAT (UK) Professional Diploma in Accounting, are entitled to exemptions from the ACCA qualification (F1, F2, F3). Following the successful completion of related study-units, learners will also be eligible to register for further exemptions, namely F4 and F5."
                ],
                "desc_mt": [
                    "Dan il-kors jibni fuq l-MCAST Advanced Diploma in Accounting u joffri lill-istudenti l-possibbiltà li jsiru membri tal-Association of Accounting Technicians (UK). Matul dan il-programm, l-istudenti jkomplu jwessgħu u jsaħħu l-istudji tagħhom fl-oqsma differenti tal-accounting, inkluż l-Accounting Finanzjarju u ta’ Mmaniġġjar, kif ukoll il-Liġi dwar il-Maniġment u n-Negozju.",
                    "L-istudenti li jlestu b’suċċess l-AAT (UK) Advanced Diploma in Accounting, kif ukoll l-AAT (UK) Professional Diploma in Accounting, ikunu intitolati għal eżenzjonijiet mill-kwalifika tal-ACCA (F1, F2, F3). Studenti li jkunu lestew b’suċċess unitajiet ta’ studju relatati, ikunu eliġibbli wkoll li jirreġistraw għal aktar eżenzjonijiet, jiġifieri F4 u F5."
                ],
                "mqf": 5,
                "duration": 2,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Accounting"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Accounts administrator",
                    "Accounts executive",
                    "Accounting technician",
                    "Audit assistant",
                    "Credit management officer",
                    "Senior accounts clerk"
                ]
            },
            {
                "index": "02-14",
                "institute": "ibmc",
                "code": "BC6-01-19",
                "title": "Bachelor of Arts (Honours) in Business Enterprise",
                "desc_en": [
                    "This degree provides specialist content which is constantly applied to real life business and management scenarios. Learners will be prepared to become proficient in a number of areas as the course allows the students to develop appropriate analytical, critical and research skills in a range of business related areas ranging from Human Resources to Operations Management, and from Purchasing to Project Management and Marketing Management. These are only some of the areas that students will cover during their studies. This 360 degree approach gives the learners maximum flexibility on the workplace as graduates would be able to deal with a wide range of responsibilities."
                ],
                "desc_mt": [
                    "Dan il-baċellerat jipprovdi lill-istudenti kontenut speċjalizzat li huwa applikat b’mod kostanti f’xenarji tan-negozju u tal-maniġment fil-ħajja reali. L-istudenti jitħejjew biex isiru profiċjenti f’għadd ta’ oqsma, billi l-kors jippermetti lill-istudenti jiżviluppaw ħiliet analitiċi, kritiċi u ta’ riċerka f’firxa ta’ oqsma relatati man-negozju, li jvarjaw mir-Riżorsi Umani sal-Immaniġġjar tal-Operazzjonijiet, u mix-Xiri sal-Immaniġġjar ta’ Proġetti u l-Immaniġġjar tal-Marketing. Dawn huma biss xi wħud mill-oqsma li l-istudenti se jkopru waqt l-istudji tagħhom. Dan l-approċċ komprensiv jagħti lill-istudenti flessibbiltà massima fuq il-post tax-xogħol, billi l-gradwati jkunu jistgħu jidħlu għal firxa wiesgħa ta’ responsabbiltajiet."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Marketing",
                    "MCAST Advanced Diploma in Administrative and Secretarial Studies",
                    "MCAST Advanced Diploma in Aviation Operations",
                    "MCAST Advanced Diploma in Financial Services",
                    "MCAST Advanced Diploma in Insurance",
                    "MCAST Advanced Diploma in Business Administration",
                    "MCAST Advanced Diploma in Transportation and Logistics Management",
                    "2 A-Level passes and 2 I-Level passes"
                ],
                "req_compusolry": "A-Level: Accounts or Marketing or Economics",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Business development manager",
                    "Human resources manager",
                    "Operations manager",
                    "Project manager",
                    "Research manager",
                    "Analyst"
                ]
            },
            {
                "index": "02-15",
                "institute": "ibmc",
                "code": "BC6-03-18",
                "title": "Bachelor of Arts (Honours) in Procurement and Finance",
                "desc_en": [
                    "This three-year Bachelor degree intends to provide learners with a strong basis of procurement processes and supporting aspects. By applying theory to both public procurement procedures as well as those adopted within the private sector, this degree will expose learners to the various aspects of Procurement Management. This is coupled with a detailed understanding of the finance function, which in itself provides the students with the capability to carry out work more effectively. Management studies are also incorporated in the programme of studies, in a way as to provide the students with a launch pad into the heart of effective operations coordination in this dynamic area."
                ],
                "desc_mt": [
                    "Dan il-kors ta’ baċellerat ta’ tliet snin huwa maħsub biex jipprovdi lill-istudenti bażi b’saħħitha dwar il-proċessi ta’ akkwist u aspetti relatati. Filwaqt li tiġi applikata t-teorija kemm għall-proċeduri ta’ akkwist pubbliku, kif ukoll għal dawk adottati fis-settur privat, din id-degree tesponi lill-istudenti għad-diversi aspetti tal-Immaniġġjar tal-Akkwist. Dan isir flimkien ma’ fehim dettaljat tal-funzjoni tal-finanzi, li fiha nnifisha twassal lill-istudenti sabiex ikunu kapaċi jwettqu x-xogħol b’mod aktar effettiv. L-istudji tal-maniġment huma inkorporati wkoll fil-programm ta’ studji, b’tali mod li jipprovdu lill-istudenti b’mezz biex jidħlu direttament fil-qalba tal-koordinazzjoni effettiva tal-operat f’dan il-qasam dinamiku."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Business Administration",
                    "MCAST Advanced Diploma in Accounting",
                    "2 A-Level passes and 2 I-Level passes"
                ],
                "req_compusolry": "A-Level: Accounts or Marketing or Economics",
                "req_preferred": "",
                "req_other": "Note: Applicants with similar qualifications may still show their interest in applying for this course. Such applications will be presented to the Admissions Board for its consideration.",
                "careers": [
                    "Procurement manager",
                    "Supply chain manager",
                    "Logistics manager",
                    "Purchasing and inventory coordinator"
                ]
            },
            {
                "index": "02-16",
                "institute": "ibmc",
                "code": "BC6-01-20",
                "title": "Bachelor of Science (Honours) in Financial Services Management",
                "desc_en": [
                    "Targeting one of Malta’s strongest economic sectors, this degree in Financial Services offers learners the opportunity to get a detailed insight into the various aspects of Financial Services, an industry which offers a range of career opportunities ranging from Risk Management to Fund Administration and Wealth Management. Apart from the more technical aspects related to financial services, learners will also gain the required analytical, critical and research skills that are required to work in such a high profile and demanding industry. Learners graduating from this degree find themselves in a very strong position in terms of employment as they are well geared to work in different sectors within this industry."
                ],
                "desc_mt": [
                    "Filwaqt li għandha fil-mira tagħha wieħed mis-setturi ekonomiċi l-aktar b’saħħithom f’Malta, din id-degree fis-Servizzi Finanzjarji toffri lill-istudenti l-opportunità li jiksbu għarfien dettaljat tad-diversi aspetti tas-Servizzi Finanzjarji, industrija li toffri firxa ta’ opportunitajiet ta’ karriera li jvarjaw mill-Ġestjoni tar-Riskju sal-Amministrazzjoni tal-Fondi u l-Immaniġġjar tal-Ġid. Minbarra l-aspetti aktar tekniċi relatati mas-servizzi finanzjarji, l-istudenti jiksbu wkoll il-ħiliet analitiċi, kritiċi u ta’ riċerka meħtieġa biex jaħdmu f’industrija ta’ profil għoli u eżiġenti bħal din. L-istudenti li jiggradwaw minn dan il-kors isibu ruħhom f’pożizzjoni b’saħħitha ħafna fir-rigward ta’ impjieg, billi jkunu kisbu l-ħiliet biex jaħdmu f’setturi differenti f’din l-industrija."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Internship",
                "req_entry": [
                    "MCAST Advanced Diploma in Financial Services",
                    "2 A-Level passes and 2 I-Level passes"
                ],
                "req_compusolry": "A-Levels: Accounts and Economics",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Banking adviser",
                    "Compliance executive",
                    "Financial adviser",
                    "Analyst",
                    "Risk management fund administrator"
                ]
            },
            {
                "index": "02-17",
                "institute": "ibmc",
                "code": "BC7-01-18",
                "title": "ACCA Qualification",
                "desc_en": [
                    "An ACCA Qualification is a path that leads to becoming an internationally recognised Chartered Certified Accountant, and can take your career in any direction. It is a rewarding and intense course with a number of Professional Courses which allows the students to have a rigorous qualification that is accepted across the globe. The ACCA course is the perfect choice for a career in accountancy and the perfect milestone on anyone’s route to become a qualified finance professional. The programme provides different exit routes at Level 6 and at Level 7."
                ],
                "desc_mt": [
                    "Kwalifika tal-ACCA twasslek biex issir Chartered Certified Accountant rikonoxxut fuq livell internazzjonali. Biha tista’ tiżviluppa l-karriera tiegħek fi kwalunkwe direzzjoni. Huwa kors intensiv li jagħti ħafna sodisfazzjon, b’għadd ta’ Korsijiet Professjonali li jwasslu biex l-istudenti jakkwistaw kwalifika rigoruża li hija aċċettata madwar id-dinja. Il-kors tal-ACCA huwa l-għażla perfetta għal min jixtieq karriera fl-Accountancy u stadju importanti perfett fit-triq ta’ kull min jixtieq isir professjonist finanzjarju kwalifikat. Il-programm jipprovdi rotot ta’ ħruġ differenti fil-Livell 6 u fil-Livell 7."
                ],
                "mqf": "6\/7",
                "duration": 4,
                "study": "FT",
                "mode": "Work Experience",
                "req_entry": [
                    "MCAST Advanced Diploma in Accounting",
                    "MCAST Advanced Diploma in Administrative and Secretarial Studies",
                    "MCAST Advanced Diploma in Business Administration"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "2 A-Level and 2 I-Level passes\\nCompulsory A-Level or SEC\/O-Level: Mathematics and English Language\\nPreferred A-Level or SEC\/O-Level: Economics, Accounts\\nLearners incur fees payable to ACCA, for any membership and examinations, and MIA (Malta Institute of Accountants) membership\\nL-istudenti jħallsu l-miżati lill-ACCA għal kwalunkwe sħubija u eżamijiet, kif ukoll sħubija fl-MIA (Malta Institute of Accountants)",
                "careers": [
                    "Accountant",
                    "Financial controller",
                    "Financial analyst",
                    "Business analyst",
                    "Corporate finance specialist",
                    "Project finance accountant"
                ]
            }
        ]
    },
    {
        "code": "ics",
        "color": "#f4b719",
        "name_en": "Institute of Community Services",
        "desc_en": "The Institute of Community Services equips learners with the required holistic skills in various fields for the well-being of our community. In particular we offer courses in Sports, Health and Social Care, Early Years, Beauty, Hairdressing, Inclusive Education and Protection, Security and Enforcement. Our vocational educators amalgamate theory and practice to provide a hands-on experience to our learners which reflects the workplace and its requirements within industry. This Institute is equipped with a number of resources to enable this approach to learning, such as fully functional hair salons, beauty salons and Care rooms. Furthermore, all VET programmes include a work placement which offers valuable experience within the industry. Courses offered range from MQF Level 1 to Level 6.",
        "name_mt": "",
        "desc_mt": "L-Istitut tas-Servizzi Komunitarji jipprovdi lill-istudenti l-ħiliet ħolistiċi meħtieġa f’diversi oqsma għall-benesseri tal-komunità tagħna. Noffru korsijiet fl-Isport, is-Saħħa u l-Kura Soċjali, l-Età Bikrija, is-Sbuħija, il-Hairdressing, l-Edukazzjoni Inklużiva u l-Protezzjoni, is- Sigurtà u l-Infurzar. L-edukaturi vokazzjonali tagħna jamalgamaw it-teorija u l-prattika biex jipprovdu esperjenza prattika lill-istudenti tagħna, li tirrifletti l-post tax-xogħol u r-rekwiżiti tiegħu fl-industrija. Dan l-Istitut huwa mgħammar b’għadd ta’ riżorsi biex ikun jista’ jseħħ dan l-approċċ għat-tagħlim, fosthom salons tax-xagħar, salons tas-sbuħija u kmamar dedikati għal programmi relatati mas-settur tal-Kura. Barra minn hekk, il-programmi ta’ VET jinkludu perjodu ta’ taħriġ fuq il-post tax-xogħol li joffri esperjenza siewja fl-industrija. Il-korsijiet offruti jvarjaw mil-Livell 1 sal-Livell 6 tal-MQF.",
        "courses": [
            {
                "index": "03-01",
                "institute": "ics",
                "code": "CS1-01-19",
                "title": "Introductory Certificate in Care",
                "desc_en": [
                    "This programme of study is an ideal start to a career in Health and Social Care for those learners who have just finished their compulsory education with minimum certification. This one-year full-time programme does not qualify the learner to work in the sector. However, the vocational and key skills modules which make up the course specification will help the learner to progress slowly to higher levels of study.",
                    "The course includes both practical and theoretical lectures which cover the basics of health and social care including basic nutrition, first aid and interpersonal communication with service-users that projects respect, integrity, dignity, and anti-discrimination."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studju huwa l-bidu ideali għal karriera fis-Saħħa u l-Kura Soċjali għal dawk l-istudenti li jkunu għadhom kemm lestew l-edukazzjoni obbligatorja tagħhom bi ftit jew xejn ċertifikati. Dan il-programm full-time ta’ sena ma jagħtix lill-istudent biżżejjed kwalifiki biex jaħdem fis-settur. Madankollu, l-unitajiet vokazzjonali u tal-ħiliet ewlenin li jiffurmaw l-ispeċifikazzjoni tal-kors iwasslu lill-istudent biex javvanza bil-mod għal livelli ogħla ta’ studju.",
                    "Il-kors jinkludi lezzjonijiet prattiċi kif ukoll ta’ teorija li jkopru l-elementi bażiċi tas-saħħa u l-kura soċjali, inklużi n-nutrizzjoni bażika, l-ewwel għajnuna u l-komunikazzjoni ma’ dawk li jużaw is-servizzi, li tkun tirrifletti r-rispett, l-integrità, id-dinjità u n-nuqqas ta’ diskriminazzjoni."
                ],
                "mqf": 1,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assessment Tests (as may be applicable)",
                "careers": []
            },
            {
                "index": "03-02",
                "institute": "ics",
                "code": "CS1-02-19",
                "title": "Introductory Certificate in Hairdressing",
                "desc_en": [
                    "This programme of studies introduces the learner to modules related to this sector. A number of interesting topics will be discussed. Examples include the different types of equipment and products typically found in hairdressing salons, customer care services, communication skills, professional attitudes, window-dressing, personal appearance and hygiene. The study-units incorporate theoretical aspects of hairdressing as well as practical sessions of basic hairdressing procedures using a mannequin head.",
                    "Learners are also given the opportunity to strengthen their key skills subjects. Weekly lessons in English Language, Maltese, Mathematics, Science, Information Technology and Individual and Social Responsibility (ISR) are delivered in a manner that will help to render the vocational units more appealing and relevant to the students."
                ],
                "desc_mt": [
                    "Dan il-programm jintroduċi lill-istudent għal suġġetti relatati ma’ dan is-settur. Eżempji jinkludu t-tipi differenti ta’ tagħmir u prodotti li normalment insibu f’salons tal-hairdressing, is-servizzi tal-kura tal-klijenti, il-ħiliet ta’ komunikazzjoni, l-attitudnijiet personali, l-arranġament tal-vetrini tas-salon, id-dehra u l-iġjene personali. L-unitajiet ta’ studju jinkorporaw aspetti teoretiċi tal-hairdressing, kif ukoll sessjonijiet prattiċi dwar il-proċeduri bażiċi tal-hairdressing fejn tintuża ras ta’ manikin.",
                    "L-istudenti jingħataw ukoll l-opportunità li jsaħħu s-suġġetti tal-ħiliet ewlenin tagħhom. Il-lezzjonijiet ta’ kull ġimgħa fl-Ingliż, il-Malti, il-Matematika, ix-Xjenza, it-Teknoloġija tal-Informazzjoni u r-Responsabbiltà Individwali u Soċjali (ISR) jingħataw b’mod li jgħinu biex l-unitajiet vokazzjonali jkunu aktar attraenti u rilevanti għall-istudenti."
                ],
                "mqf": 1,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assessment Tests (as may be applicable)",
                "careers": []
            },
            {
                "index": "03-03",
                "institute": "ics",
                "code": "CS2-01-19",
                "title": "Foundation Certificate in Care",
                "desc_en": [
                    "This programme of studies is aimed at those individuals who wish to embark on a future career in the Health and Social Care Sector. During the year the learners will have a variety of lectures which will give them an understanding of basic concepts related to this sector. Lectures will focus on human behaviour, the way the body works and what constitutes a safe working environment. Learners will also be given the opportunity to strengthen their key skills subjects including Maltese, English, Mathematics and Science through the vocational perspective.",
                    "Learners will have the opportunity to visit organisations related to this sector so that they become accustomed to the environment."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studju full-time huwa mmirat lejn dawk l-individwi li fil-futur jixtiequ jibdew karriera fis-Settur tas-Saħħa u l-Kura Soċjali. Matul is-sena, l-istudenti jkollhom varjetà ta’ lezzjonijiet li jagħtuhom tagħrif dwar il-kunċetti bażiċi relatati ma’ dan is-settur. Il-lezzjonijiet jiffokaw fuq l-imġiba tal-bniedem, il-mod kif jaħdem il-ġisem u x’inhu dak li jagħmel ambjent tax-xogħol sikur. L-istudenti jingħataw ukoll l-opportunità li jsaħħu s-suġġetti tal-ħiliet ewlenin tagħhom, inklużi l-Malti, l-Ingliż, il-Matematika u x-Xjenza mil-lat vokazzjonali.",
                    "L-istudenti jkollhom l-opportunità li jżuru organizzazzjonijiet relatati ma’ dan is-settur sabiex isiru familjari mal-ambjent. Fl-aħħar ta’ dan il-kors ta’ sena, l-istudenti jkollhom l-opportunità li javvanzaw għal-livell ta’ Diploma fl-istess settur."
                ],
                "mqf": 2,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education",
                    "MCAST Introductory Certificate"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assessment Tests (as may be applicable)",
                "careers": []
            },
            {
                "index": "03-04",
                "institute": "ics",
                "code": "CS2-02-19",
                "title": "Foundation Certificate in Hairdressing, Beauty and Well-Being",
                "desc_en": [
                    "This programme of study provides an overview of the different routes available to learners within the Institute of Community Services, whilst leaving all their options open.",
                    "The modules on offer provide learners with basic knowledge in health and safety practices employed during beauty and hairdressing techniques and procedures. Other modules focus on an understanding of the basic scientific concepts related to all hair and beauty services and treatments, while introducing the learners to basic business concepts.",
                    "The course also provides learners with quality work experience exposure where they will be expected to assist and carry out a range of assigned tasks, using approved models. Learners are required to purchase the necessary hairdressing and beauty accessories at the beginning of the academic year."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji jipprovdi ħarsa ġenerali lejn it-toroq differenti li huma disponibbli għall-istudenti fl-Istitut tas-Servizzi Komunitarji, filwaqt li jħallilhom miftuħa l-għażliet kollha.",
                    "L-unitajiet offruti jipprovdu lill-istudenti b’għarfien bażiku tal-prattiċi tas-saħħa u s-sigurtà użati fit-teknika u l-proċeduri tas-sbuħija u l-hairdressing. Unitajiet oħra jiffokaw fuq l-għarfien tal-kunċetti xjentifiċi bażiċi relatati mas-servizzi u t-trattamenti kollha tax-xagħar u tas-sbuħija; u jintroduċu wkoll lill-istudenti għall-kunċetti bażiċi tan-negozju.",
                    "Il-kors jesponi lill-istudenti għal esperjenza ta’ xogħol ta’ kwalità fejn ikunu mistennija jużaw mudelli approvati biex jassistu u jwettqu firxa ta’ xogħlijiet assenjati lilhom. L-istudenti huma meħtieġa jixtru l-aċċessorji neċessarji tal-hairdressing u tas-sbuħija fil-bidu tas-sena akkademika."
                ],
                "mqf": 2,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compulsory Education",
                    "MCAST Introductory Certificate"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assessment Tests (as may be applicable)",
                "careers": []
            },
            {
                "index": "03-05",
                "institute": "ics",
                "code": "CS2-03-19",
                "title": "Foundation Certificate in Sport",
                "desc_en": [
                    "This programme of studies serves as a stepping stone to a future working career in the sport sector. The learner experiences the practical and basic theoretical components of a number of sports and fitness related subjects. The vocational study-units cover the basics of health and active lifestyles, community sports, fitness training methods and include an introduction to gym-based exercise. Concurrently, learners strengthen their knowledge of the key skills in English, Maltese, Mathematics, Science, Information Technology, and Individual and Social Responsibility. Throughout the academic year, MCAST and the Institute of Community Services organise a number of sport related extra-curricular activities in which the learners will be invited to participate in order to enrich their experience on campus."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji jservi bħala pass lejn karriera ta’ xogħol futura fis-settur tal-isport. L-istudent jesperjenza l-komponenti teoretiċi prattiċi u bażiċi ta’ għadd ta’ suġġetti relatati mal-isport u mal-kundizzjoni fiżika tajba. L-unitajiet ta’ studju vokazzjonali jkopru l-elementi bażiċi ta’ saħħa tajba u stili ta’ ħajja attiva, l-isport fil-komunità, il-metodi ta’ taħriġ għal kundizzjoni fiżika tajba, u jinkludu introduzzjoni għall-eżerċizzju bbażat fil-gym. Fl-istess ħin, l-istudenti jsaħħu l-għarfien tagħhom tal-ħiliet ewlenin fl-Ingliż, il-Malti, il-Matematika, ix-Xjenza, it-Teknoloġija tal-Informazzjoni, u r-Responsabbiltà Individwali u Soċjali. Matul is-sena akkademika, l-MCAST u l-Istitut tas-Servizzi Komunitarji jorganizzaw għadd ta’ attivitajiet extrakurrikulari relatati mal-isport li fihom l-istudenti jkunu mistiedna jipparteċipaw sabiex l-esperjenza tagħhom fil-kampus tkun ferm isbaħ."
                ],
                "mqf": 2,
                "duration": 1,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "Finished Compolsory Education",
                    "MCAST Introductory Certificate"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "Initial Assesment Tests (as may be applicable)\\nMedical clearance required",
                "careers": []
            },
            {
                "index": "03-06",
                "institute": "ics",
                "code": "CS3-01-19",
                "title": "Diploma for Beauty Specialists",
                "desc_en": [
                    "This programme of studies offers learners the possibility to seek employment in salons as Beauty Specialists. Alternatively, students who complete successfully this one-year full-time course may wish to consider furthering their studies by progressing to the Level 4 Advanced Diploma programme in Beauty and Complementary Therapies.",
                    "Leaners are guided on how to develop and carry out individual treatment plans based on the specific requirements of each individual client. Treatments include skin care, manicure and pedicure, depilation, nails, make-up services, eyebrow and eyelash treatments. Other modules relate to health and safety practices in the salon and business aspects including business plans, effective communication skills and proper conduct with clients."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji joffri lill-istudenti l-possibbiltà li jfittxu impjieg fis-salons bħala Speċjalisti tas-Sbuħija. Min-naħa l-oħra, l-istudenti li jtemmu dan il-kors b’suċċess jistgħu jikkunsidraw li jkomplu l-istudji tagħhom billi jidħlu ghall-Advanced Diploma in Beauty and Complementary Therapies (Livell 4).",
                    "L-istudenti jingħataw gwida dwar kif għandhom iwettqu trattamenti individwali mfassla għal kull klijent individwali. Dawn it-trattamenti jistgħu jinkludu trattamenti għall-kura tal-ġilda, tal-idejn u tas-saqajn, depilazzjoni, il-kura tad-dwiefer, servizzi ta’ make-up u trattamenti tax-xagħar tal-għajnejn u tal-ħuġbejn. Unitajiet oħra jirrigwardjaw prattiċi tas-saħħa u s-sigurtà fis-salon u aspetti tan-negozju inklużi pjanijiet tan-negozju, ħiliet ta’ komunikazzjoni effettivi u mġiba tajba mal-klijenti."
                ],
                "mqf": 3,
                "duration": 1,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Foundation Certificate",
                    "2 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "English Language, Biology, Chemistry, Home Economics, Art",
                "req_other": "",
                "careers": [
                    "Beauty specialist"
                ]
            },
            {
                "index": "03-07",
                "institute": "ics",
                "code": "CS3-A2-19",
                "title": "Diploma in Hairdressing – Women",
                "desc_en": [
                    "Hairdressing is a creative industry which requires skilled technical stylists to cope with the customers’ demands. In today’s fast-moving world self-image is your brand. This programme of studies provides the learners with the skills and confidence to step on to the road to success; indeed, the opportunities are endless.",
                    "Learners cover a variety of interesting study-units such as client consultation, hair styling for different occasions, hair colouring, perming and straightening. This includes experience in the Community Services salons as well as placements in industry as part of the Apprenticeship scheme. Learners will also further develop their knowledge in key skills."
                ],
                "desc_mt": [
                    "Il-hairdressing huwa industrija kreattiva li tirrikjedi stilisti tekniċi kwalifikati biex ilaħħqu mad-domanda tal-klijenti. Fid-dinja mgħaġġla tal-lum, l-immaġni tal-persuna tiddefiniha. Dan il-programm ta’ studji jipprovdi lill-istudenti bil-ħiliet u l-kunfidenza biex jibdew it-triq għas-suċċess; fil-fatt l-opportunitajiet huma bla limitu.",
                    "L-istudenti jkopru varjetà ta’ unitajiet ta’ studju bħall-konsultazzjoni tal-klijenti, l-issettjar tax-xagħar għal okkażjonijiet differenti, iż-żebgħa, l-ippermjar u l-illixxjar tax-xagħar. Dan jinkludi esperjenza fis-salons tal-Istitut tas-Servizzi Komunitarji, kif ukoll esperjenza ta’ xogħol fl-industrija bħala parti mill-iskema tal-Apprendistat. L-istudenti jkomplu wkoll jiżviluppaw l-għarfien tagħhom f’ħiliet ewlenin."
                ],
                "mqf": 3,
                "duration": 2,
                "study": "FT",
                "mode": "Apprenticeship",
                "req_entry": [
                    "MCAST Foundation Certificate",
                    "2 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "English Language, Biology, Chemistry, Physics, Home Economics, General Science, Art",
                "req_other": "",
                "careers": [
                    "Junior hair stylist for women, Sales representative for hair products"
                ]
            },
            {
                "index": "03-08",
                "institute": "ics",
                "code": "CS3-03-19",
                "title": "Diploma in Health and Social Care",
                "desc_en": [
                    "Prospective candidates who enrol in this course should have an interest in working with elderly persons and persons with different abilities. Lectures include a number of varied topics such as nutrition, equality, diversity, dignity and rights of individuals. Moreover, this programme of studies provides a route for education within a number of specialised areas such as the Social Care sector, Early Years Education, and Health Sciences. The programme offers an opportunity for learners to carry out work-based learning in two different host organisations which form part of the sector. Here they will be expected to carry out a range of assigned tasks under supervision.",
                    "In the case of learners who do not wish to further their studies, this one-year programme provides a suitable exit point to seek employment as a care worker."
                ],
                "desc_mt": [
                    "Il-kandidati prospettivi li jirreġistraw għal dan il-kors full-time għandu jkollhom interess li jaħdmu ma’ persuni anzjani u individwi b’kapaċitajiet differenti. Il-lezzjonijiet jinkludu għadd ta’ suġġetti varjati bħan-nutrizzjoni, l-ugwaljanza, id-diversità, id-dinjità u d-drittijiet tal-individwi. Barra minn hekk, dan il-programm ta’ studji jwitti t-triq għal edukazzjoni f’għadd ta’ oqsma speċjalizzati bħas-settur tal-Kura Soċjali, l-Edukazzjoni tat-Tfal fis-Snin Bikrin, u x-Xjenzi tas-Saħħa. Il-programm joffri opportunità biex l-istudenti jirċievu tagħlim ibbażat fil-post tax-xogħol, f’organizzazzjonijiet ospitanti differenti li jiffurmaw parti mis-settur. Hawnhekk ikunu mistennija jwettqu taħt superviżjoni, ix-xogħol li huma jiġu assenjati.",
                    "Fil-każ ta’ studenti li ma jixtiqux ikomplu l-istudji tagħhom, dan il-programm ta’ sena jipprovdi punt ta’ ħruġ xieraq biex wieħed isib impjieg bħala ħaddiem ta’ appoġġ jew assistent fil-qasam tal-kura tas-saħħa."
                ],
                "mqf": 3,
                "duration": 1,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Foundation Certificate",
                    "2 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "English Language, Biology, Physics, Chemistry, Maltese, Social Studies, Nutrition, Food Consumer Studies (Home Economics)",
                "req_other": "Prior to embarking on any Placement, learners need to:\\n• satisfy the requirements of the Protection of Minors Act (POMA);\\n• satisfy specific immunisation requirements; and •\\n present a clean police conduct.",
                "careers": [
                    "Care worker, Care assistant, Support care worker"
                ]
            },
            {
                "index": "03-09",
                "institute": "ics",
                "code": "CS3-04-19",
                "title": "Diploma in Sport",
                "desc_en": [
                    "This programme of studies covers the basics of Anatomy and Physiology in Sport, Fitness Testing, Fitness Instruction, Fundamental Methodology of Physical Activity and Sport, as well as the theory and practice of the mainstream sports. The syllabus incorporates a work-based learning component thus facilitating the transition into employment for those learners who do not wish to further their studies. By the end of the course, the learner will be able to assist a Fitness Instructor in the preparation and delivery of basic fitness training programmes.",
                    "The learner will be encouraged to take part in various sports-related events that are organised on campus from time to time."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji jkopri l-elementi bażiċi tal-Anatomija u l-Fiżjoloġija fl-Isport, l-Ittestjar tal-Kundizzjoni Fiżika Tajba, l-Istruzzjoni għal Kundizzjoni Fiżika Tajba, il-Metodoloġija Fundamentali tal-Attività Fiżika u l-Isport, kif ukoll it-teorija u l-prattika tal-isport l-iktar komuni. Is-sillabu jinkludi komponent ta’ tagħlim fil-post tax-xogħol li jiffaċilita t-tranżizzjoni f’impjieg għal dawk l-istudenti li ma jixtiqux ikomplu jistudjaw. Sal-aħħar tal-kors, l-istudent ikun kapaċi jassisti lill-Għalliem tal-Fitness iħejji u jgħallem programmi bażiċi ta’ taħriġ għal kundizzjoni fiżika tajba.",
                    "L-istudent jiġi mħeġġeġ jieħu sehem f’diversi avvenimenti relatati mal-isport li huma organizzati fil-kampus minn żmien għal żmien."
                ],
                "mqf": 3,
                "duration": 1,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Foundation Certificate",
                    "2 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "English Language, Biology, Physical Education",
                "req_other": "Medical clearance is required.\\nApplicants are expected to successfully fulfill the requirements of a Fitness Test.",
                "careers": [
                    "Assistant fitness instructor, Sports fundamentals assistant coach, Gym instructor"
                ]
            },
            {
                "index": "03-10",
                "institute": "ics",
                "code": "CS3-05-18",
                "title": "Extended Diploma in Foundation Studies for Security, Enforcement and Protection",
                "desc_en": [
                    "This programme is gaining a lot of popularity with learners who intend to seek future employment within the Academy for Disciplined Forces. Lecturers will discuss current and contemporary issues relating to security, enforcement and protection both in Malta and beyond our shores. Learners will also tackle topics related to equality, diversity, dignity and rights of individuals. Educational visits will be organised to different departments which form part of the Academy: the Civil Protection Department, the Police Force, the Armed Forces of Malta and the Law Courts.",
                    "This Extended Diploma course is delivered over two years. However, learners can opt to exit after the successful completion of their first year of studies. In this case, they will be eligible to attain a Level 3 Diploma in Foundation Studies for Security, Enforcement and Protection."
                ],
                "desc_mt": [
                    "Dan il-programm qed jikseb ħafna popolarità mal-istudenti li għandhom l-intenzjoni li fil-futur isibu impjieg fl-Akkademja għal Forzi Dixxiplinati. L-istudenti jiddiskutu kwistjonijiet kurrenti u kontemporanji relatati mas-sikurezza, l-infurzar u l-protezzjoni, kemm f’Malta kif ukoll lil hinn minn xtutna. L-istudenti jittrattaw ukoll suġġetti relatati mal-ugwaljanza, id-diversità, id-dinjità u d-drittijiet ta’ l-individwi. Jiġu organizzati żjarat edukattivi f’dipartimenti differenti li jiffurmaw parti mill-Akkademja: id-Dipartiment tal-Protezzjoni Ċivili, il-Pulizija, il-Forzi Armati ta’ Malta u l-Qrati.",
                    "Dan il-kors ta’ Diploma Estiża jdum sentejn. Madankollu, l-istudenti jistgħu jagħżlu li joħorġu minn dan il-kors wara li jlestu b’suċċess l-ewwel sena tal-istudji tagħhom. F’dan il-każ, ikunu eliġibbli biex jiksbu Diploma in Foundation Studies for Security, Enforcement and Protection tal-Livell 3."
                ],
                "mqf": 3,
                "duration": 2,
                "study": "FT",
                "mode": "",
                "req_entry": [
                    "MCAST Foundation Certificate",
                    "2 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Careers in Disciplined Forces (further training may apply depending on the chosen career path)"
                ]
            },
            {
                "index": "03-11",
                "institute": "ics",
                "code": "CS4-01-19",
                "title": "Advanced Diploma in Beauty and Complementary Therapies",
                "desc_en": [
                    "This programme is made up of study-units intended to equip learners with the knowledge to provide treatments for the purpose of relaxation and stress relief as well as to improve the condition of the skin. Learners will have the opportunity to perform practical tasks during hands-on sessions within the MCAST salons. There will also be work placement periods within established Salons and Spas.",
                    "Study-units during the second year of studies include alternative therapies such as reflexology, stone therapy and aromatherapy.",
                    "At the end of the first academic year, successful learners will have the option to exit their studies, and be awarded the MCAST Award in Beauty Therapy. This award will enable them to work in the industry as beauty therapists."
                ],
                "desc_mt": [
                    "Dan il-programm huwa magħmul minn unitajiet ta’ studju maħsuba biex jagħtu lill-istudenti l-għarfien biex jipprovdu trattamenti għall-finijiet ta’ rilassament u serħan mill-istress, kif ukoll biex itejbu l-kundizzjoni tal-ġilda. L-istudenti jkollhom l-opportunità li jwettqu xogħlijiet prattiċi matul sessjonijiet prattiċi fis-salons tal-MCAST. Ikun hemm ukoll perjodi ta’ esperjenza ta’ xogħol f’Salons u Spas stabbiliti.",
                    "L-unitajiet ta’ studju matul it-tieni sena tal-istudji jinkludu terapiji alternattivi bħal reflexology, stone therapy u aromatherapy.",
                    "L-istudenti li jtemmu l-ewwel sena akkademika b’suċċess ikollhom l-għażla li jieqfu mill-istudji tagħhom u jingħataw l-MCAST Award in Beauty Therapy. Permezz ta’ din l-għotja, huma jkunu jistgħu jaħdmu fl-industrija bħala terapisti tas-sbuħijia."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "ITEC Diploma for Beauty Specialists",
                    "MCAST Diploma for Beauty Specialists"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Beauty therapist"
                ]
            },
            {
                "index": "03-12",
                "institute": "ics",
                "code": "CS4-04-19",
                "title": "Advanced Diploma in Children’s Care, Learning and Development",
                "desc_en": [
                    "This programme provides major emphasis on the practical components which form an integral part of the programme. Learners are taught how to observe babies and toddlers in an early years’ environment, to be able to help each child reach his or her maximum potential. Innovative methods are used to plan activities for children in a childcare setting. Other topics include the safeguarding and promotion of children’s rights and the creation of a safe and engaging environment where positive development can take place.",
                    "At the end of the first academic year, successful learners will have the option to exit their studies, and be awarded the MCAST Award in Children’s Care, Learning and Development. This award will enable them to work as child care practitioners."
                ],
                "desc_mt": [
                    "Dan il-programm jagħti importanza kbira lill-komponenti prattiċi li jiffurmaw parti integrali tal-programm. L-istudenti jiġu mgħallma kif josservaw lit-trabi u t-tfal iż-żgħar f’ambjent ta’ snin bikrija, biex ikunu jistgħu jgħinu lit-tfal jilħqu l-potenzjal massimu tagħhom. Jintużaw metodi innovattivi biex jiġu ppjanati attivitajiet għal tfal f’ambjent tal-kura tat-tfal. Lezzjonijiet oħra jinkludu suġġetti dwar it-tħaris u l-promozzjoni tad-drittijiet tat-tfal u l-ħolqien ta’ ambjent sikur u motivanti fejn jista’ jseħħ żvilupp pożittiv.",
                    "L-istudenti li jtemmu l-ewwel sena akkademika b’suċċess ikollhom l-għażla li ma jkomplux l-istudji tagħhom, u jingħataw l-MCAST Award in Children’s Care, Learning and Development. Permezz ta’ din l-għotja, huma jkunu jistgħu jaħdmu bħala prattikanti fil-qasam tal-kura tat-tfal."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Diploma in Health and Social Care",
                    "MCAST Diploma in Sport",
                    "MCAST Diploma in Performing Arts",
                    "MCAST Diploma in Art and Design",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "English Language, Maltese, Mathematics",
                "req_other": "Prior to embarking on any Placement, learners need to:\\n• satisfy the requirements of the Protection of Minors Act (POMA);\\n• present a clean police conduct\\n• complete a Basic First Aid course\\n• complete a Paediatric First Aid course.",
                "careers": [
                    "Child care practitioner"
                ]
            },
            {
                "index": "03-13",
                "institute": "ics",
                "code": "CS4-02-19",
                "title": "Advanced Diploma in Health and Social Care",
                "desc_en": [
                    "This is a two-year full-time programme during which the learner becomes better acquainted with the specialised services offered by different agencies and organisations in the care sector. This programme of studies is ideal for those prospective candidates who derive a lot of personal satisfaction from helping others. Lectures deal with sociological and psychological perspectives, legislation, communication skills and human biology.",
                    "Lecturers will present scenarios which are dynamic and thought-provoking, and learners are prepared to work in challenging environments dealing with vulnerable individuals. A work-based learning component is included in the framework of this programme. Learners who successfully graduate from this programme of studies are very much in demand and all manage to find immediate employment in the sector."
                ],
                "desc_mt": [
                    "Dan huwa programm full-time ta’ sentejn li matulu l-istudent isir aktar familjari mas-servizzi speċjalizzati offruti minn aġenziji u organizzazzjonijiet differenti fis-settur tal-kura. Dan il-programm ta’ studji huwa ideali għal dawk il-kandidati prospettivi li jiksbu sodisfazzjon personali meta jgħinu lill-oħrajn. Il-lezzjonijiet jittrattaw perspettivi soċjoloġiċi u psikoloġiċi, il-leġiżlazzjoni, il-ħiliet tal-komunikazzjoni u l-bijoloġija tal-bniedem.",
                    "L-għalliema jippreżentaw xenarji li huma dinamiċi u li jġiegħlu lill-istudenti jaħsbu, u l-istudenti jitħejjew biex jaħdmu f’ambjenti ta’ sfida ma’ individwi vulnerabbli. Komponent ta’ tagħlim ibbażat fuq ix-xogħol huwa inkluż fil-qafas ta’ dan il-programm. L-istudenti li jiggradwaw b’suċċess minn dan il-programm ta’ studji huma meħtieġa ferm u kollha jirnexxilhom isibu impjieg fis-settur immedjatament."
                ],
                "mqf": 4,
                "duration": 2,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Diploma in Health and Social Care",
                    "MCAST Diploma in Applied Science",
                    "MCAST Diploma in Sport",
                    "MCAST Diploma in Foundation Studies for Security, Enforcement and Protection",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "Health and Social Care, English Language, Maltese, Ethics, Social Studies, Home Economics, Biology",
                "req_other": "Prior to embarking on any Placement, learners need to present a clean police conduct.",
                "careers": [
                    "Social support worker"
                ]
            },
            {
                "index": "03-14",
                "institute": "ics",
                "code": "CS4-03-19",
                "title": "Advanced Diploma in Sport (Development, Coaching and Fitness)",
                "desc_en": [
                    "This is a full-time programme with a strong emphasis on work-based learning. The course looks into coaching, fitness, and sports development, as well as modules relating to sports injury and sports as a business venture. Placement experience provided throughout the course further strengthens these abilities.",
                    "During the two years of study, the learner will be exposed to an array of practical and theoretical modules related to the sector. As an entry criterion to the course, the learners would need to undertake and pass a basic Fitness Test that physically tests the learners’ personal level of fitness in terms of flexibility, cardiovascular endurance, power, speed and agility."
                ],
                "desc_mt": [
                    "Dan huwa programm full-time b’enfasi qawwija fuq it-tagħlim waqt esperjenzi fil-post tax-xogħol. Il-kors jittratta l-ikkowċjar, il-fitness, l-iżvilupp, u jinkludi unitajiet ta’ studju relatati ma’ korrimenti waqt l-isport u l-isport bħala negozju. L-esperjenza ta’ xogħol waqt il-kors tkompli ssaħħaħ il-kapaċità tal-istudent f’dawn l-oqsma.",
                    "Matul is-sentejn ta’ studju, l-istudent jiltaqa’ ma’ firxa ta’ unitajiet prattiċi u teoretiċi relatati mas-settur. Bħala kriterju għad-dħul fil-kors, l-istudenti jkunu meħtieġa joqogħdu għal u jgħaddu minn Test bażiku ta’ Kundizzjoni Fiżika Tajba li għandu l-għan li jittestja l-livell personali tal-fitness tal-istudenti f’dak li għandu x’jaqsam ma flessibbiltà, reżistenza kardjovaskolari, saħħa, veloċità u aġilità."
                ],
                "mqf": 2,
                "duration": 4,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Diploma in Sport",
                    "MCAST Diploma in Applied Science",
                    "MCAST Diploma in Health and Social Care",
                    "MCAST Diploma in Foundation Studies for Security, Enforcement and Protection",
                    "4 SEC\/O-Level\/SSC&P (Level 3) passes"
                ],
                "req_compusolry": "",
                "req_preferred": "Physical Education, English Language, Biology",
                "req_other": "Medical clearance required.\\nApplicants are expected to successfully fulfill the requirements of a fitness test in terms of flexibility, cardiovascular endurance, power, speed and agility.",
                "careers": [
                    "Fitness instructor, Fitness coach, Gym instructor\/coach, Sport fundamentals coach, Sport development officer, Sport activity organiser"
                ]
            },
            {
                "index": "03-15",
                "institute": "ics",
                "code": "CS5-01-19",
                "title": "Higher Diploma in Advanced Studies in the Early Years",
                "desc_en": [
                    "This programme is one of the most sought-after courses within this Institute. It is highly popular since it provides ample opportunities to find employment at the end of the two-year programme.",
                    "The study-units are designed in a manner that provides a strong link between theoretical concepts and hands-on practice during internships. Lectures focus on guiding the undergraduates on how to make learning for young children stimulating and fun, in a safe and healthy environment.",
                    "Upon completion of this programme, the undergraduates may proceed to the final year of the Bachelor of Arts (Hons) in Early Childhood Education and Care (ECEC) within the Faculty of Education, University of Malta, subject to fulfilling a number of requirements relating to proficiency in the Maltese and English languages."
                ],
                "desc_mt": [
                    "Dan il-programm huwa wieħed mill-aktar korsijiet popolari f’dan l-Istitut. Huwa popolari ħafna minħabba li jipprovdi numru ta’ opportunitajiet biex wieħed isib impjieg fi tmiem il-programm ta’ sentejn.",
                    "L-unitajiet ta’ studju huma mfassla b’tali mod li jipprovdu rabta qawwija bejn kunċetti teoretiċi u l-prattika matul internships. Il-lezzjonijiet jiggwidaw lill-istudenti dwar kif it-tagħlim jista’ jkun stimulanti u ta’ interess għat-tfal iż-żgħar, f’ambjent sikur u tajjeb għas-saħħa.",
                    "Meta jlestu dan il-programm, l-istudenti jistgħu jkomplu bl-istudji tagħhom fl-aħħar sena tal-Bachelor of Arts (Hons) in Early Childhood Education and Care (ECEC) fil-Fakultà tal-Edukazzjoni, l-Università ta’ Malta, basta li jissodisfaw għadd ta’ rekwiżiti relatati mal-profiċjenza fil-lingwa Maltija u f’dik Ingliża."
                ],
                "mqf": 5,
                "duration": 2,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Advanced Diploma in Children’s Care, Learning and Development",
                    "2 A-Level passes and 2 I-Level passes"
                ],
                "req_compusolry": "A-level or I-level: Two subjects from Mathematics, English, Maltese\\nApplicants need to be in possession of a pass at SEC\/O-Level in the subject that is not presented at A-level or I-level.",
                "req_preferred": "",
                "req_other": "Prior to embarking on any Placement, learners need to:\\n• satisfy the requirements of the Protection of Minors Act (POMA);\\n• present a clean police conduct\\n• complete a Basic First Aid course\\n• complete a Paediatric First Aid course.",
                "careers": [
                    "Early years educator"
                ]
            },
            {
                "index": "03-16",
                "institute": "ics",
                "code": "CS6-01-19",
                "title": "Bachelor of Arts (Honours) in Health and Social Care (Management)",
                "desc_en": [
                    "The Health and Social Care sector provides a number of career opportunities for successful learners to find engaging and rewarding employment at the end of this degree programme of studies. Throughout the duration of the course, undergraduates participate in work placement experiences in related settings under the supervision of experienced professionals.",
                    "This programme of studies includes a varied pool of modules aimed at enhancing the undergraduates’ managerial attributes, amongst which Governance and Quality Management and European Law and Social Policy. Other study-units focus on the importance of the undergraduates to keep abreast of current issues that different categories of service-users may encounter such as Globalisation and Poverty and Family and Individual Functioning."
                ],
                "desc_mt": [
                    "Is-settur tas-Saħħa u l-Kura Soċjali jipprovdi għadd ta’ opportunitajiet ta’ karriera biex l-istudenti li jtemmu dan il-kors b’suċċess isibu impjieg motivanti u ta’ sodisfazzjon fi tmiem dan il-programm ta’ studji. Matul il-kors kollu, l-istudenti tal-baċellerat jipparteċipaw f’esperjenzi ta’ internship f’ambjenti relatati, taħt is-superviżjoni ta’ professjonisti ta’ esperjenza.",
                    "Dan il-programm ta’ studji jinkludi ġabra varjata ta’ unitajiet immirati lejn it-tisħiħ tal-karatteristiċi maniġerjali tal-istudenti tal-baċellerat, fosthom Il-Governanza u l-Ġestjoni tal-Kwalità u Il-Liġi Ewropea u l-Politika Soċjali. Unitajiet ta’ studju oħra jiffokaw fuq l-importanza li l-istudenti jżommu ruħhom aġġornati fir-rigward ta’ kwistjonijiet kurrenti li jistgħu jiffaċċjaw kategoriji differenti ta’ dawk li jużaw is-servizzi bħalma huma Il-Globalizzazzjoni u l-Faqar u Il-Familja u l-Funzjonament Individwali."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Advanced Diploma in Health and Social Care",
                    "MCAST Advanced Diploma in Applied Science",
                    "MCAST Advanced Diploma for Pharmacy Technicians",
                    "MCAST Advanced Diploma in Health Sciences",
                    "2 A-Level passes and 2 I-Level passes and SEC\/O-Lev-el Pass in English Language"
                ],
                "req_compusolry": "",
                "req_preferred": "A-Level or I-Level: Chemistry, Biology, Physics, Sociology, Psychology, Home Economics and Human Ecology, Accounts, Economics",
                "req_other": "",
                "careers": [
                    "Administrative and\/or managerial positions within the Health and Social Care sector, Social welfare professional"
                ]
            },
            {
                "index": "03-17",
                "institute": "ics",
                "code": "CS6-03-18",
                "title": "Bachelor of Arts (Honours) in Inclusive Education",
                "desc_en": [
                    "This programme of studies focuses on how educational institutions in general, and the classroom settings, specifically, can become more inclusive to cater for different individual needs.",
                    "The undergraduates tackle a variety of study-units aimed at identifying what barriers exist which may be preventing students from accessing quality education. Furthermore, the study-units also explore innovative techniques of how these barriers can be overcome so that all students feel valued during compulsory schooling years, and possibly beyond. This course includes internship opportunities aimed at developing a mindset of promoting inclusive communities that celebrate diversity and cater for the diverse needs of different groups of students."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji jiffoka fuq kif l-istituzzjonijiet edukattivi, b’mod ġenerali, u l-ambjenti tal-klassi b’mod speċifiku, jistgħu jsiru aktar inklużivi biex jilħqu ħtiġijiet individwali differenti.",
                    "L-istudenti tal-baċellerat jittrattaw varjetà ta’ unitajiet ta’ studju, bil-għan li jiġu identifikati liema ostakoli jistgħu jkunu qegħdin ma jħallux lill-istudenti jkollhom aċċess għal edukazzjoni ta’ kwalità. Barra minn hekk, l-unitajiet ta’ studju jesploraw ukoll teknika innovattiva dwar kif jistgħu jingħelbu dawn l-ostakoli sabiex l-istudenti kollha jħossuhom stmati matul is-snin ta’ edukazzjoni obbligatorja, u possibilment lil hinn minnhom. Dan il-kors jinkludi opportunitajiet ta’ internship immirati lejn l-iżvilupp ta’ mentalità li tippromwovi komunitajiet inklużivi li jiċċelebraw id-diversità."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Advanced Diploma in Children’s Care, Learning and Development",
                    "MCAST Advanced Diploma in Health and Social Care",
                    "2 A-Level passes and 2 I-Level passes, to include at least one A-Level and one I-Level from Mathematics, English, Maltese, Philosophy, Sociology, Psychology"
                ],
                "req_compusolry": "",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Learning support educator (LSE)"
                ]
            },
            {
                "index": "03-18",
                "institute": "ics",
                "code": "CS6-02-20",
                "title": "Bachelor of Science (Honours) in Sport, Exercise and Health",
                "desc_en": [
                    "This programme of studies covers modules that prepare the undergraduates to work alongside medical and healthcare professionals in promoting physical activity and exercise; and are mapped to the rigorous standards upheld by various international accrediting bodies in the field. The ultimate aim will be to improve the general health of the individual and of society as a whole. This course provides learners with hands-on experience throughout the three years, to engage in exercise, health and fitness programmes, conferences and events on and off campus working with different sectors of the community.",
                    "The undergraduates will develop the knowledge and skills required to assist clients and patients in their various health challenges, non-communicable diseases, health conditions, injuries or disabilities. Furthermore the degree programme also aims to facilitate the pursuit of a number of distinctive sport or exercise-related Master’s (Level 7) programmes."
                ],
                "desc_mt": [
                    "Dan il-programm ta’ studji jkopri unitajiet ta’ studju li jħejju lill-istudenti tal-baċellerat biex jaħdmu ma’ professjonisti mediċi u fil-kura tas-saħħa fil-promozzjoni tal-attività fiżika u l-eżerċizzju; u jissodisfaw l-istandards rigorużi osservati minn diversi korpi internazzjonali ta’ akkreditazzjoni fil-qasam. L-għan aħħari jkun li titjieb is-saħħa ġenerali tal-individwu u tas-soċjetà kollha. Permezz ta’ esperjenza prattika matul it-tliet snin tal-kors, l-istudenti jieħdu sehem fi sport, programmi ta’ saħħa u fitness, konferenzi u avvenimenti kemm ġewwa kif ukoll barra l-kampus, u jaħdmu ma’ setturi differenti tal-komunità.",
                    "L-istudenti jiżviluppaw l-għarfien u l-ħiliet meħtieġa biex jassistu lill-klijenti u lill-pazjenti fid-diversi sfidi tas-saħħa tagħhom, bħal mard li ma jitteħidx, kundizzjonijiet ta’ saħħa, korrimenti jew diżabilità. Barra minn hekk, il-programm għandu wkoll l-għan li jiffaċilita l-aċċess għal numru ta’ programmi differenti relatati mal-isport jew mal-eżerċizzju fil-livell ta’ Master’s (Livell 7)."
                ],
                "mqf": 6,
                "duration": 3,
                "study": "FT",
                "mode": "Work Placement",
                "req_entry": [
                    "MCAST Advanced Diploma in Sports (Development, Coaching and Fitness)",
                    "2 A-Level passes and 2 I-Level passes and SEC\/O-Level pass in English Language"
                ],
                "req_compusolry": "I-or A-Level: Physics or Chemistry or Biolo-gy or Physical Education",
                "req_preferred": "",
                "req_other": "",
                "careers": [
                    "Personal trainer, Exercise for health professional, Specialist trainer, Sports activity manager, Functional sports trainer"
                ]
            }
        ]
    },
    {
        "code": "ica",
        "color": "#ca2f88",
        "name_en": "Institute for the Creative Arts",
        "desc_en": "Formerly known as the Institute of Art and Design, this Institute was established in 2001, merging the expertise of the Art and Design Centre and Salvatore Dimech School for Craftsmen. In 2014, the name was changed to Institute for the Creative Arts to reflect its growing portfolio of courses offered, ranging from art and design to graphic design and interactive media, creative media production, photography and journalism, and recently, fashion design and performing arts as well as cultural heritage skills. The Institute works closely with the industry to provide students with realistic assignment briefs and experiences. The creative arts play a crucial role in communicating visions and ideas which words alone cannot fully express. They may also be perceived as a means to educate, to provide a cultural identity and act as agents of change.",
        "name_mt": "",
        "desc_mt": "Dan l-Istitut, li ġie stabbilit fl-2001, qabel kien magħruf bħala l-Istitut tal-Arti u d-Disinn u għaqqad flimkien il-kompetenzi taċ-Ċentru tal- Arti u d-Disinn u tal-Iskola Salvatore Dimech għal Persuni tas-Sengħa. Fl-2014, l-isem inbidel għall-Istitut għall-Arti Kreattiva, biex jirrifletti l-portafoll dejjem jikber ta’ korsijiet offruti, li jvarjaw mill-arti u d-disinn, għad-disinn grafiku u l-midja interattiva, il-produzzjoni tal-midja kreattiva, il-fotografija u l-ġurnaliżmu, id-disinn tal-moda u l-arti tal-ispettaklu, kif ukoll il-ħiliet tal-patrimonju kulturali. L-Istitut jaħdem mill-qrib mal-industrija biex jipprovdi lill-istudenti tagħrif u esperjenzi ta’ xogħol realistiċi. L-arti kreattiva għandha rwol kruċjali fil-komunikazzjoni ta’ viżjonijiet u ideat li ma jistgħux jiġu espressi bil-kliem biss. Tista’ tiġi meqjusa wkoll bħala mezz ta’ edukazzjoni, li tipprovdi identità kulturali u taġixxi bħala aġent tal-bidla.",
        "courses": []
    },
    {
        "code": "iet",
        "color": "#104b9b",
        "name_en": "Institute of Engineering & Transport",
        "desc_en": "Well equipped with the latest technology in the various areas of Engineering and Transport related training programmes, the Institute prides itself on a portfolio of VET programmes covering MQF Levels 1 to 7, ranging from the generic to the specific. In order to provide sectorial focus, the Institute is organised into a number of Centres and Departments, covering the respective areas, namely: Aviation Maintenance and Training, Building and Construction, Electrical and Electronics, Mechanical Engineering and Maritime Studies. Thus, learners interested in embarking on a career in any of the above mentioned areas, can start off their studies at an entry level which fits their current qualifications, progressing towards the achievement of prestigious exit level qualifications, some of which may also provide possible eligibility for Professional Warrant recognition (subject to specific requirements).",
        "name_mt": "",
        "desc_mt": "Dan l-Istitut, li huwa mgħammar sew bit- teknoloġija l-aktar riċenti fid-diversi oqsma tal-programmi tat-taħriġ relatati mal-Inġinerija u t-Trasport, għandu portafoll ta’ programmi VET li jkopru l-Livelli 1 sa 7 tal-MQF, u li jvarjaw minn programmi ġeneriċi għal dawk speċifiċi. Sabiex jipprovdi fokus settorjali, l-Istitut huwa organizzat f’għadd ta’ Ċentri u Dipartimenti li jkopru l-oqsma rispettivi, jiġifieri: Iċ-Ċentru tal- Manutenzjoni u t-Taħriġ fil-Qasam tal-Avjazzjoni, Id-Dipartiment għall-Bini u l-Kostruzzjoni, Id-Dipartiment għall-Elettriku u l-Elettronika, Id-Dipartiment għall-Inġinerija Mekkanika, Iċ-Ċentru għall-Istudji Marittimi. Hekk, l-istudenti interessati li jibdew karriera fi kwalunkwe qasam minn dawk imsemmija hawn fuq, ikunu jistgħu jibdew l-istudji tagħhom f’livell ta’ dħul li jaqbel mal-kwalifiki attwali tagħhom, u jibqgħu javvanzaw sakemm, meta jiġu biex iħallu l-Kulleġġ, ikunu kisbu kwalifiki prestiġjużi li, fil-każ ta’ wħud minnhom, hemm il-possibbiltà li jiġu rikonuxxuti permezz ta’ Warrant Professjonali (dejjem jekk ikunu jissodisfaw rekwiżiti speċifiċi).",
        "courses": []
    },
    {
        "code": "iict",
        "color": "#e96c24",
        "name_en": "Institute of Information & Communication Technology",
        "desc_en": "The Institute of Information and Communication Technology is the natural choice one should consider before finding a job in the ICT industry. This is a dynamic sector which requires a number of technical people to cope with the constantly evolving computing technologies. The Institute offers various entry points for everyone to successfully obtain the required qualification with the possibility to continue furthering their studies at higher levels. We work closely with the industry to keep our courses relevant to their needs while providing the best training using the latest tools and new emerging technologies.",
        "name_mt": "",
        "desc_mt": "L-Istitut tat-Teknoloġija tal-Informazzjoni u l-Komunikazzjoni huwa l-għażla naturali li wieħed għandu jikkunsidra qabel ma jfittex impjieg fl-industrija tal-ICT. Dan huwa settur dinamiku li jirrikjedi għadd ta’ persuni tekniċi biex ilaħħqu mat-teknoloġiji tal-kompjuters li dejjem jevolvu. L-Istitut joffri diversi punti ta’ dħul għal kulħadd biex wieħed ikun jista’ jikseb b’suċċess il-kwalifika meħtieġa, bil-possibbiltà li jkompli jistudja f’livelli ogħla. Aħna naħdmu mill-qrib mal-industrija biex inżommu l-korsijiet tagħna rilevanti għall-ħtiġijiet tagħha, filwaqt li nipprovdu l-aħjar taħriġ bl-użu tal-għodod l-aktar riċenti u t-teknoloġiji ġodda li qed jiġu żviliuppati.",
        "courses": []
    },
    {
        "code": "gc",
        "color": "#1abcee",
        "name_en": "Gozo Campus",
        "desc_en": "The MCAST Gozo Campus offers a selection of 24 full-time day courses ranging from MQF Levels 1 to 6 and covering a broad spectrum of vocational disciplines. Some of these programmes lead learners directly to employment, whilst others lead to higher level studies in Gozo and\/or Malta. In either case, learners are thoroughly prepared for their next step, whichever that may be. MCAST training programmes delivered at the Gozo Campus fulfil the same quality assurance standards that are applicable to the same programmes delivered at the respective MCAST Institute in Malta, ensuring that Gozitan students benefit from the same quality of service on their home ground. Learners hailing from the northern region of Malta who choose to study at the Gozo Campus are eligible for a government subsidy.",
        "name_mt": "",
        "desc_mt": "Il-Kampus tal-MCAST f’Għawdex joffri għażla ta’ 24 kors full-time, li jvarjaw minn Livell 1 sa 6 tal-MQF u jkopru numru sewwa ta’ dixxiplini vokazzjonali. Xi wħud minn dawn il-programmi jwasslu lill-istudenti direttament għal impjieg, filwaqt li oħrajn jagħtuhom aċċess għal studji ta’ livell ogħla f’Għawdex u\/jew Malta. Fi kwalunkwe każ, l-istudenti jitħejjew bir-reqqa għall-pass li jkun imiss, ikun xi jkun. Il-programmi tat-taħriġ tal-MCAST ipprovduti fil-Kampus t’Għawdex jissodisfaw l-istess standards ta’ assigurazzjoni tal-kwalità li huma applikabbli għall-istess programmi li jiġu pprovduti fl-Istituti rispettivi tal-MCAST f’Malta, filwaqt li jiżguraw li l-istudenti Għawdxin jibbenefikaw mill-istess kwalità ta’ servizz fil-gżira tagħhom. L-istudenti li jiġu mir-reġjun tat-Tramuntana ta’ Malta li jagħżlu li jistudjaw fil- Kampus t’Għawdex huma eliġibbli għal sussidju mill-gvern.",
        "courses": []
    },
    {
        "code": "gd",
        "color": "#000000",
        "name_en": "Generic Degrees",
        "desc_en": "",
        "name_mt": "",
        "desc_mt": "",
        "courses": []
    },
    {
        "code": "md",
        "color": "#752980",
        "name_en": "Masters Degrees",
        "desc_en": "",
        "name_mt": "",
        "desc_mt": "",
        "courses": []
    },
    {
        "code": "cpd",
        "color": "#000000",
        "name_en": "CPD",
        "desc_en": "",
        "name_mt": "",
        "desc_mt": "",
        "courses": []
    }
]